# ！/usr/bin/env python
# -*- coding:utf-8 -*-
# @Author:wenlong.jin
# @Time:2022/10/31 13:08
# @File:plc_key.py
"""
    开发代码对应：
        D:\nio\controlsystem\SRC\driver\BS\com\PLC_type.h
        D:\nio\controlsystem\SRC\driver\BS\bin\BS_HARDWARE_SERVICE_CLASS.cpp
"""
from utils.log import log

ALARM_KEY_INDEX = {
    # 0: "0",  # //运动控制子系统故障
    1: "714000",  # //主控柜急停按钮被按下
    2: "714001",  # //左开合门打开超时
    3: "714002",  # //左开合门打开时加解锁平台升降未在零点位
    4: "714003",  # //左开合门打开时左前车身定位销未缩回
    5: "714004",  # //左开合门打开时左后车身定位销未缩回
    6: "714005",  # //左开合门关闭超时
    7: "714006",  # //左开合门关闭时加解锁平台升降未在零点位
    8: "714007",  # //左开合门关闭时左前车身定位销未缩回
    9: "714008",  # //左开合门关闭时左后车身定位销未缩回
    10: "714009",  # //右开合门打开超时
    11: "714010",  # //右开合门打开时加解锁平台升降未在零点位
    12: "714011",  # //右开合门打开时右后车身定位销未缩回
    13: "714012",  # //右开合门关闭超时
    14: "714013",  # //右开合门关闭时加解锁平台升降未在零点位
    15: "714014",  # //右开合门关闭时右后车身定位销未缩回
    16: "714015",  # //停车平台前导向条伸出超时
    17: "714016",  # //停车平台前导向条伸出时加解锁平台升降未在零点位
    18: "714017",  # //停车平台前导向条缩回超时
    19: "714018",  # //停车平台后导向条伸出超时
    20: "714019",  # //停车平台后导向条伸出时加解锁平台升降未在零点位
    21: "714020",  # //停车平台后导向条缩回超时
    22: "714021",  # //加解锁平台平移至零点位超时
    23: "714022",  # //加解锁平台平移至零点位时加解锁平台升降未在零点位
    24: "714023",  # //加解锁平台平移至零点位时停车平台前导向条未缩回
    25: "714024",  # //加解锁平台平移至零点位时停车平台后导向条未缩回
    26: "714025",  # //加解锁平台平移至零点位时左前车身定位销未缩回
    27: "714026",  # //加解锁平台平移至零点位时右后车身定位销未缩回
    28: "714027",  # //加解锁平台平移至零点位时左后车身定位销未缩回
    29: "714028",  # //加解锁平台平移至工作位超时
    30: "714029",  # //加解锁平台平移至工作位时加解锁平台升降未在零点位
    31: "714030",  # //加解锁平台平移至工作位时停车平台前导向条未缩回
    32: "714031",  # //加解锁平台平移至工作位时停车平台后导向条未缩回
    33: "714032",  # //加解锁平台平移至工作位时左前车身定位销未缩回
    34: "714033",  # //加解锁平台平移至工作位时右后车身定位销未缩回
    35: "714034",  # //加解锁平台平移至工作位时左后车身定位销未缩回
    36: "714035",  # //加解锁平台升降至零点位时超时
    37: "714036",  # //加解锁平台升降至零点位时缓存位安全传感器被触发
    38: "714037",  # //加解锁平台升降至零点位时接驳位安全传感器被触发
    39: "714038",  # //加解锁平台升降至零点位时左开合门未打开
    40: "714039",  # //加解锁平台升降至零点位时右开合门未打开
    41: "714040",  # //加解锁平台升降至零点位时加解锁平台平移未在零点位
    42: "714041",  # //加解锁平台升降至卡销位时缓存位安全传感器被触发
    43: "714042",  # //加解锁平台升降至卡销位时接驳位安全传感器被触发
    44: "714043",  # //加解锁平台升降至卡销位时左开合门未打开
    45: "714044",  # //加解锁平台升降至卡销位时右开合门未打开
    46: "714045",  # //加解锁平台升降至卡销位时加解锁平台平移未在零点位
    47: "714046",  # //加解锁平台升降至卡销位时枪头位置与电池类型不匹配
    48: "714047",  # //加解锁平台升降至销子位时缓存位安全传感器被触发
    49: "714048",  # //加解锁平台升降至销子位时接驳位安全传感器被触发
    50: "714049",  # //加解锁平台升降至销子位时左开合门未打开
    51: "714050",  # //加解锁平台升降至销子位时右开合门未打开
    52: "714051",  # //加解锁平台升降至销子位时停车平台前导向条未缩回
    53: "714052",  # //加解锁平台升降至销子位时停车平台后导向条未缩回
    54: "714053",  # //加解锁平台升降至销子位时加解锁平台平移未在零点位
    55: "714054",  # //加解锁平台升降至销子位时四轮推杆未在工作位
    56: "714055",  # //加解锁平台升降至销子位时枪头位置与电池类型不匹配
    57: "714056",  # //加解锁平台升降至销子位时电池落到位传感器断开1
    58: "714057",  # //加解锁平台升降至销子位时电池落到位传感器断开2
    59: "714058",  # //加解锁平台升降至销子位时电池落到位传感器断开3
    60: "714059",  # //加解锁平台升降至销子位时电池落到位传感器断开4
    61: "714060",  # //加解锁平台升降至销子位时电池落到位传感器断开5
    62: "714061",  # //加解锁平台升降至销子位时电池落到位传感器断开6
    63: "714062",  # //加解锁平台升降至插头位时缓存位安全传感器被触发
    64: "714063",  # //加解锁平台升降至插头位时接驳位安全传感器被触发
    65: "714064",  # //加解锁平台升降至插头位时左开合门未打开
    66: "714065",  # //加解锁平台升降至插头位时右开合门未打开
    67: "714066",  # //加解锁平台升降至插头位时停车平台前导向条未缩回
    68: "714067",  # //加解锁平台升降至插头位时停车平台后导向条未缩回
    69: "714068",  # //加解锁平台升降至插头位时加解锁平台平移未在零点位
    70: "714069",  # //加解锁平台升降至插头位时四轮推杆未在工作位
    71: "714070",  # //加解锁平台升降至插头位时枪头位置与电池类型不匹配
    72: "714071",  # //加解锁平台升降至插头位时电池落到位传感器1断开
    73: "714072",  # //加解锁平台升降至插头位时电池落到位传感器2断开
    74: "714073",  # //加解锁平台升降至插头位时电池落到位传感器3断开
    75: "714074",  # //加解锁平台升降至插头位时电池落到位传感器4断开
    76: "714075",  # //加解锁平台升降至插头位时电池落到位传感器5断开
    77: "714076",  # //加解锁平台升降至插头位时电池落到位传感器6断开
    78: "714077",  # //加解锁平台升降至插头位时加解锁平台低于插头位
    79: "714078",  # //加解锁平台升降至工作位时缓存位安全传感器被触发
    80: "714079",  # //加解锁平台升降至工作位时接驳位安全传感器被触发
    81: "714080",  # //加解锁平台升降至工作位时左开合门未打开
    82: "714081",  # //加解锁平台升降至工作位时右开合门未打开
    83: "714082",  # //加解锁平台升降至工作位时停车平台前导向条未缩回
    84: "714083",  # //加解锁平台升降至工作位时停车平台后导向条未缩回
    85: "714084",  # //加解锁平台升降至工作位时加解锁平台平移未在零点位
    86: "714085",  # //加解锁平台升降至工作位时四轮推杆未在工作位
    87: "714086",  # //加解锁平台升降至工作位时枪头位置与电池类型不匹配
    88: "714087",  # //加解锁平台升降至工作位时左前车身定位销未缩回
    89: "714088",  # //加解锁平台升降至工作位时右后车身定位销未缩回
    90: "714089",  # //加解锁平台升降至工作位时左后车身定位销未缩回
    91: "714090",  # //加解锁平台升降至工作位时左前车身定位销缩回不同步
    92: "714091",  # //加解锁平台升降至工作位时右后车身定位销缩回不同步
    93: "714092",  # //加解锁平台升降至工作位时左后车身定位销缩回不同步
    94: "714093",  # //9号枪头平移至零点位超时
    95: "714094",  # //9号枪头平移至零点位时加解锁平台高于销子位
    96: "714095",  # //9号枪头平移至零点位时加解锁平台上有电池
    97: "714096",  # //9号枪头平移至工作位超时
    98: "714097",  # //9号枪头平移至工作位时加解锁平台高于销子位
    99: "714098",  # //9号枪头平移至工作位时加解锁平台上有电池
    100: "714099",  # //10号枪头平移至零点位超时
    101: "714100",  # //10号枪头平移至零点位时加解锁平台高于销子位
    102: "714101",  # //10号枪头平移至零点位时加解锁平台上有电池
    103: "714102",  # //10号枪头平移至工作位超时
    104: "714103",  # //10号枪头平移至工作位时加解锁平台高于销子位
    105: "714104",  # //10号枪头平移至工作位时加解锁平台上有电池
    106: "714105",  # //9号枪头升降至零点位超时
    107: "714106",  # //9号枪头升降至工作位超时
    108: "714107",  # //9号枪头升降至工作位时电池类型不匹配
    109: "714108",  # //9号枪头升降至工作位时加解锁平台上有电池
    110: "714109",  # //10号枪头升降至零点位超时
    111: "714110",  # //10号枪头升降至工作位超时
    112: "714111",  # //10号枪头升降至工作位时电池类型不匹配
    113: "714112",  # //10号枪头升降至工作位时加解锁平台上有电池
    114: "714113",  # //1号枪头升降至零点位超时
    115: "714114",  # //1号枪头升降至工作位超时
    116: "714115",  # //1号枪头升降至工作位时电池类型不匹配
    117: "714116",  # //1号枪头升降至工作位时加解锁平台上有电池
    118: "714117",  # //2号枪头升降至零点位超时
    119: "714118",  # //2号枪头升降至工作位超时
    120: "714119",  # //2号枪头升降至工作位时电池类型不匹配
    121: "714120",  # //2号枪头升降至工作位时加解锁平台上有电池
    122: "714121",  # //1’号枪头升降至零点位超时
    123: "714122",  # //1’号枪头升降至工作位超时
    124: "714123",  # //1’号枪头升降至工作位时电池类型不匹配
    125: "714124",  # //1’号枪头升降至工作位时加解锁平台上有电池
    126: "714125",  # //2’号枪头升降至零点位超时
    127: "714126",  # //2’号枪头升降至工作位超时
    128: "714127",  # //2’号枪头升降至工作位时电池类型不匹配
    129: "714128",  # //2’号枪头升降至工作位时加解锁平台上有电池
    130: "714129",  # //左前车身定位销缩回超时
    131: "714130",  # //左前车身定位销缩回时左开合门未打开
    132: "714131",  # //左前车身定位销伸出超时
    133: "714132",  # //左前车身定位销伸出时加解锁平台高于销子位
    134: "714133",  # //左前车身定位销伸出时右开合门未打开
    135: "714134",  # //右后车身定位销缩回超时
    136: "714135",  # //右后车身定位销缩回时右开合门未打开
    137: "714136",  # //右后车身定位销伸出超时
    138: "714137",  # //右后车身定位销伸出时加解锁平台高于销子位
    139: "714138",  # //右后车身定位销伸出时右开合门未打开
    140: "714139",  # //左后车身定位销缩回超时
    141: "714140",  # //左后车身定位销缩回时左开合门未打开
    142: "714141",  # //左后车身定位销伸出超时
    143: "714142",  # //左后车身定位销伸出时加解锁平台高于销子位
    144: "714143",  # //左后车身定位销伸出时开合门未打开
    145: "714144",  # //停车平台前挡块缩回超时
    146: "714145",  # //停车平台前挡块伸出超时
    147: "714146",  # //停车平台前挡块伸出时前电池到位传感器触发
    148: "714147",  # //停车平台前挡块伸出时后电池到位传感器触发
    149: "714148",  # //停车平台前挡块伸出时缓存位安全传感器触发
    150: "714149",  # //停车平台后挡块缩回超时
    151: "714150",  # //停车平台后挡块伸出超时
    152: "714151",  # //停车平台后挡块伸出时前电池到位传感器触发
    153: "714152",  # //停车平台后挡块伸出时后电池到位传感器触发
    154: "714153",  # //停车平台后挡块伸出时缓存位电池安全传感器触发
    155: "714154",  # //堆垛机平移时货叉未在零点
    156: "714155",  # //堆垛机平移时左上超程开关被触发
    157: "714156",  # //堆垛机平移时左下超程开关被触发
    158: "714157",  # //堆垛机平移时右上超程开关被触发
    159: "714158",  # //堆垛机平移时右下超程开关被触发
    160: "714159",  # //堆垛机平移至前仓超时
    161: "714160",  # //堆垛机平移至后仓超时
    162: "714161",  # //堆垛机平移至升降仓超时
    163: "714162",  # //堆垛机升降至#1仓超时
    164: "714163",  # //堆垛机升降至#2仓超时
    165: "714164",  # //堆垛机升降至#3仓超时
    166: "714165",  # //堆垛机升降至#4仓超时
    167: "714166",  # //堆垛机升降至#5仓超时
    168: "714167",  # //堆垛机升降至#6仓超时
    169: "714168",  # //堆垛机升降至#7仓超时
    170: "714169",  # //堆垛机升降至#8仓超时
    171: "714170",  # //堆垛机升降至#9仓超时
    172: "714171",  # //堆垛机升降至#10仓超时
    173: "714172",  # //堆垛机升降至#11仓超时
    174: "714173",  # //堆垛机升降至#12仓超时
    175: "714174",  # //堆垛机升降至#13仓超时
    176: "714175",  # //堆垛机升降至#14仓超时
    177: "714176",  # //堆垛机升降至#15仓超时
    178: "714177",  # //堆垛机升降至#16仓超时
    179: "714178",  # //堆垛机升降至#17仓超时
    180: "714179",  # //堆垛机升降至#18仓超时
    181: "714180",  # //堆垛机升降至#19仓超时
    182: "714181",  # //堆垛机升降至#20仓超时
    183: "714182",  # //堆垛机升降至#21仓超时
    184: "714183",  # //堆垛机升降至#22仓超时
    185: "714184",  # //堆垛机升降至升降仓超时
    186: "714185",  # //堆垛机升降时货叉未在零点或未在工作位
    187: "714186",  # //堆垛机升降时左上超程开关被触发
    188: "714187",  # //堆垛机升降时左下超程开关被触发
    189: "714188",  # //堆垛机升降时右上超程开关被触发
    190: "714189",  # //堆垛机升降时右下超程开关被触发
    191: "714190",  # //堆垛机升降时堆垛机平移未在前工作位
    192: "714191",  # //堆垛机升降时堆垛机平移未在后工作位
    193: "714192",  # //堆垛机升降时堆垛机平移未在升降仓工作位
    194: "714193",  # //堆垛机升降至#1仓时堆垛机低于对接低位
    195: "714194",  # //堆垛机升降至#2仓时堆垛机低于对接低位
    196: "714195",  # //堆垛机升降至#3仓时堆垛机低于对接低位
    197: "714196",  # //堆垛机升降至#4仓时堆垛机低于对接低位
    198: "714197",  # //堆垛机升降至#5仓时堆垛机低于对接低位
    199: "714198",  # //堆垛机升降至#6仓时堆垛机低于对接低位
    200: "714199",  # //堆垛机升降至#7仓时堆垛机低于对接低位
    201: "714200",  # //堆垛机升降至#8仓时堆垛机低于对接低位
    202: "714201",  # //堆垛机升降至#9仓时堆垛机低于对接低位
    203: "714202",  # //堆垛机升降至#10仓时堆垛机低于对接低位
    204: "714203",  # //堆垛机升降至#11仓时堆垛机低于对接低位
    205: "714204",  # //堆垛机升降至#12仓时堆垛机低于对接低位
    206: "714205",  # //堆垛机升降至#13仓时堆垛机低于对接低位
    207: "714206",  # //堆垛机升降至#14仓时堆垛机低于对接低位
    208: "714207",  # //堆垛机升降至#15仓时堆垛机低于对接低位
    209: "714208",  # //堆垛机升降至#16仓时堆垛机低于对接低位
    210: "714209",  # //堆垛机升降至#17仓时堆垛机低于对接低位
    211: "714210",  # //堆垛机升降至#18仓时堆垛机低于对接低位
    212: "714211",  # //堆垛机升降至#19仓时堆垛机低于对接低位
    213: "714212",  # //堆垛机升降至#20仓时堆垛机低于对接低位
    214: "714213",  # //堆垛机升降至#21仓时堆垛机低于对接低位
    215: "714214",  # //堆垛机升降至#22仓时堆垛机低于对接低位
    216: "714215",  # //堆垛机升降至升降仓时堆垛机低于对接低位
    217: "714216",  # //堆垛机升降至#1仓时堆垛机高于对接高位
    218: "714217",  # //堆垛机升降至#2仓时堆垛机高于对接高位
    219: "714218",  # //堆垛机升降至#3仓时堆垛机高于对接高位
    220: "714219",  # //堆垛机升降至#4仓时堆垛机高于对接高位
    221: "714220",  # //堆垛机升降至#5仓时堆垛机高于对接高位
    222: "714221",  # //堆垛机升降至#6仓时堆垛机高于对接高位
    223: "714222",  # //堆垛机升降至#7仓时堆垛机高于对接高位
    224: "714223",  # //堆垛机升降至#8仓时堆垛机高于对接高位
    225: "714224",  # //堆垛机升降至#9仓时堆垛机高于对接高位
    226: "714225",  # //堆垛机升降至#10仓时堆垛机高于对接高位
    227: "714226",  # //堆垛机升降至#11仓时堆垛机高于对接高位
    228: "714227",  # //堆垛机升降至#12仓时堆垛机高于对接高位
    229: "714228",  # //堆垛机升降至#13仓时堆垛机高于对接高位
    230: "714229",  # //堆垛机升降至#14仓时堆垛机高于对接高位
    231: "714230",  # //堆垛机升降至#15仓时堆垛机高于对接高位
    232: "714231",  # //堆垛机升降至#16仓时堆垛机高于对接高位
    233: "714232",  # //堆垛机升降至#17仓时堆垛机高于对接高位
    234: "714233",  # //堆垛机升降至#18仓时堆垛机高于对接高位
    235: "714234",  # //堆垛机升降至#19仓时堆垛机高于对接高位
    236: "714235",  # //堆垛机升降至#20仓时堆垛机高于对接高位
    237: "714236",  # //堆垛机升降至#21仓时堆垛机高于对接高位
    238: "714237",  # //堆垛机升降至#22仓时堆垛机高于对接高位
    239: "714238",  # //堆垛机升降至升降仓时堆垛机高于对接高位
    240: "714239",  # //堆垛机升降至升降仓时升降仓高于工作位
    241: "714240",  # //堆垛机升降至#1仓高位时左水插头未缩回
    242: "714241",  # //堆垛机升降至#1仓高位时右水插头未缩回
    243: "714242",  # //堆垛机升降至#1仓高位时前电插头未缩回
    244: "714243",  # //堆垛机升降至#1仓高位时后电插头未缩回
    245: "714244",  # //堆垛机升降至#2仓高位时左水插头未缩回
    246: "714245",  # //堆垛机升降至#2仓高位时右水插头未缩回
    247: "714246",  # //堆垛机升降至#2仓高位时前电插头未缩回
    248: "714247",  # //堆垛机升降至#2仓高位时后电插头未缩回
    249: "714248",  # //堆垛机升降至#3仓高位时左水插头未缩回
    250: "714249",  # //堆垛机升降至#3仓高位时右水插头未缩回
    251: "714250",  # //堆垛机升降至#3仓高位时前电插头未缩回
    252: "714251",  # //堆垛机升降至#3仓高位时后电插头未缩回
    253: "714252",  # //堆垛机升降至#4仓高位时左水插头未缩回
    254: "714253",  # //堆垛机升降至#4仓高位时右水插头未缩回
    255: "714254",  # //堆垛机升降至#4仓高位时前电插头未缩回
    256: "714255",  # //堆垛机升降至#4仓高位时后电插头未缩回
    257: "714256",  # //堆垛机升降至#5仓高位时左水插头未缩回
    258: "714257",  # //堆垛机升降至#5仓高位时右水插头未缩回
    259: "714258",  # //堆垛机升降至#5仓高位时前电插头未缩回
    260: "714259",  # //堆垛机升降至#5仓高位时后电插头未缩回
    261: "714260",  # //堆垛机升降至#6仓高位时左水插头未缩回
    262: "714261",  # //堆垛机升降至#6仓高位时右水插头未缩回
    263: "714262",  # //堆垛机升降至#6仓高位时前电插头未缩回
    264: "714263",  # //堆垛机升降至#6仓高位时后电插头未缩回
    265: "714264",  # //堆垛机升降至#7仓高位时左水插头未缩回
    266: "714265",  # //堆垛机升降至#7仓高位时右水插头未缩回
    267: "714266",  # //堆垛机升降至#7仓高位时前电插头未缩回
    268: "714267",  # //堆垛机升降至#7仓高位时后电插头未缩回
    269: "714268",  # //堆垛机升降至#8仓高位时左水插头未缩回
    270: "714269",  # //堆垛机升降至#8仓高位时右水插头未缩回
    271: "714270",  # //堆垛机升降至#8仓高位时前电插头未缩回
    272: "714271",  # //堆垛机升降至#8仓高位时后电插头未缩回
    273: "714272",  # //堆垛机升降至#9仓高位时左水插头未缩回
    274: "714273",  # //堆垛机升降至#9仓高位时右水插头未缩回
    275: "714274",  # //堆垛机升降至#9仓高位时前电插头未缩回
    276: "714275",  # //堆垛机升降至#9仓高位时后电插头未缩回
    277: "714276",  # //堆垛机升降至#10仓高位时左水插头未缩回
    278: "714277",  # //堆垛机升降至#10仓高位时右水插头未缩回
    279: "714278",  # //堆垛机升降至#10仓高位时前电插头未缩回
    280: "714279",  # //堆垛机升降至#10仓高位时后电插头未缩回
    281: "714280",  # //堆垛机升降至#11仓高位时左水插头未缩回
    282: "714281",  # //堆垛机升降至#11仓高位时右水插头未缩回
    283: "714282",  # //堆垛机升降至#11仓高位时前电插头未缩回
    284: "714283",  # //堆垛机升降至#11仓高位时后电插头未缩回
    285: "714284",  # //堆垛机升降至#12仓高位时左水插头未缩回
    286: "714285",  # //堆垛机升降至#12仓高位时右水插头未缩回
    287: "714286",  # //堆垛机升降至#12仓高位时前电插头未缩回
    288: "714287",  # //堆垛机升降至#12仓高位时后电插头未缩回
    289: "714288",  # //堆垛机升降至#13仓高位时左水插头未缩回
    290: "714289",  # //堆垛机升降至#13仓高位时右水插头未缩回
    291: "714290",  # //堆垛机升降至#13仓高位时前电插头未缩回
    292: "714291",  # //堆垛机升降至#13仓高位时后电插头未缩回
    293: "714292",  # //堆垛机升降至#14仓高位时左水插头未缩回
    294: "714293",  # //堆垛机升降至#14仓高位时右水插头未缩回
    295: "714294",  # //堆垛机升降至#14仓高位时前电插头未缩回
    296: "714295",  # //堆垛机升降至#14仓高位时后电插头未缩回
    297: "714296",  # //堆垛机升降至#15仓高位时左水插头未缩回
    298: "714297",  # //堆垛机升降至#15仓高位时右水插头未缩回
    299: "714298",  # //堆垛机升降至#15仓高位时前电插头未缩回
    300: "714299",  # //堆垛机升降至#15仓高位时后电插头未缩回
    301: "714300",  # //堆垛机升降至#16仓高位时左水插头未缩回
    302: "714301",  # //堆垛机升降至#16仓高位时右水插头未缩回
    303: "714302",  # //堆垛机升降至#16仓高位时前电插头未缩回
    304: "714303",  # //堆垛机升降至#16仓高位时后电插头未缩回
    305: "714304",  # //堆垛机升降至#17仓高位时左水插头未缩回
    306: "714305",  # //堆垛机升降至#17仓高位时右水插头未缩回
    307: "714306",  # //堆垛机升降至#17仓高位时前电插头未缩回
    308: "714307",  # //堆垛机升降至#17仓高位时后电插头未缩回
    309: "714308",  # //堆垛机升降至#18仓高位时左水插头未缩回
    310: "714309",  # //堆垛机升降至#18仓高位时右水插头未缩回
    311: "714310",  # //堆垛机升降至#18仓高位时前电插头未缩回
    312: "714311",  # //堆垛机升降至#18仓高位时后电插头未缩回
    313: "714312",  # //堆垛机升降至#19仓高位时左水插头未缩回
    314: "714313",  # //堆垛机升降至#19仓高位时右水插头未缩回
    315: "714314",  # //堆垛机升降至#19仓高位时前电插头未缩回
    316: "714315",  # //堆垛机升降至#19仓高位时后电插头未缩回
    317: "714316",  # //堆垛机升降至#20仓高位时左水插头未缩回
    318: "714317",  # //堆垛机升降至#20仓高位时右水插头未缩回
    319: "714318",  # //堆垛机升降至#20仓高位时前电插头未缩回
    320: "714319",  # //堆垛机升降至#20仓高位时后电插头未缩回
    321: "714320",  # //堆垛机升降至#21仓高位时前电插头未缩回
    322: "714321",  # //堆垛机升降至#21仓高位时后电插头未缩回
    323: "714322",  # //货叉#1仓伸出时堆垛机升降未在对接位
    324: "714323",  # //货叉#1仓高位伸出时左水插头未缩回
    325: "714324",  # //货叉#1仓高位伸出时右水插头未缩回
    326: "714325",  # //货叉#1仓高位伸出时前电插头未缩回
    327: "714326",  # //货叉#1仓高位伸出时后电插头未缩回
    328: "714327",  # //货叉#1仓高位伸出时仓内有电池NPA传感器触发
    329: "714328",  # //货叉#1仓高位伸出时仓内有电池NPD传感器触发
    330: "714329",  # //货叉#1仓高位伸出时仓内有电池到位传感器触发
    331: "714330",  # //货叉#1仓低位伸出货叉有电池
    332: "714331",  # //货叉伸出时堆垛机平移未在前仓
    333: "714332",  # //货叉伸出时堆垛机平移未在后仓
    334: "714333",  # //货叉伸出时堆垛机平移未在升降仓
    335: "714334",  # //货叉#2仓伸出时堆垛机升降未在对接位
    336: "714335",  # //货叉#2仓高位伸出时左水插头未缩回
    337: "714336",  # //货叉#2仓高位伸出时右水插头未缩回
    338: "714337",  # //货叉#2仓高位伸出时前电插头未缩回
    339: "714338",  # //货叉#2仓高位伸出时后电插头未缩回
    340: "714339",  # //货叉#2仓高位伸出时仓内有电池NPA传感器触发
    341: "714340",  # //货叉#2仓高位伸出时仓内有电池NPD传感器触发
    342: "714341",  # //货叉#2仓高位伸出时仓内有电池到位传感器触发
    343: "714342",  # //货叉#2仓低位伸出货叉有电池
    344: "714343",  # //货叉#3仓伸出时堆垛机升降未在对接位
    345: "714344",  # //货叉#3仓高位伸出时左水插头未缩回
    346: "714345",  # //货叉#3仓高位伸出时右水插头未缩回
    347: "714346",  # //货叉#3仓高位伸出时前电插头未缩回
    348: "714347",  # //货叉#3仓高位伸出时后电插头未缩回
    349: "714348",  # //货叉#3仓高位伸出时仓内有电池NPA传感器触发
    350: "714349",  # //货叉#3仓高位伸出时仓内有电池NPD传感器触发
    351: "714350",  # //货叉#3仓高位伸出时仓内有电池到位传感器触发
    352: "714351",  # //货叉#3仓低位伸出货叉有电池
    353: "714352",  # //货叉#4仓伸出时堆垛机升降未在对接位
    354: "714353",  # //货叉#4仓高位伸出时左水插头未缩回
    355: "714354",  # //货叉#4仓高位伸出时右水插头未缩回
    356: "714355",  # //货叉#4仓高位伸出时前电插头未缩回
    357: "714356",  # //货叉#4仓高位伸出时后电插头未缩回
    358: "714357",  # //货叉#4仓高位伸出时仓内有电池NPA传感器触发
    359: "714358",  # //货叉#4仓高位伸出时仓内有电池NPD传感器触发
    360: "714359",  # //货叉#4仓高位伸出时仓内有电池到位传感器触发
    361: "714360",  # //货叉#4仓低位伸出货叉有电池
    362: "714361",  # //货叉#5仓伸出时堆垛机升降未在对接位
    363: "714362",  # //货叉#5仓高位伸出时左水插头未缩回
    364: "714363",  # //货叉#5仓高位伸出时右水插头未缩回
    365: "714364",  # //货叉#5仓高位伸出时前电插头未缩回
    366: "714365",  # //货叉#5仓高位伸出时后电插头未缩回
    367: "714366",  # //货叉#5仓高位伸出时仓内有电池NPA传感器触发
    368: "714367",  # //货叉#5仓高位伸出时仓内有电池NPD传感器触发
    369: "714368",  # //货叉#5仓高位伸出时仓内有电池到位传感器触发
    370: "714369",  # //货叉#5仓低位伸出货叉有电池
    371: "714370",  # //货叉#6仓伸出时堆垛机升降未在对接位
    372: "714371",  # //货叉#6仓高位伸出时左水插头未缩回
    373: "714372",  # //货叉#6仓高位伸出时右水插头未缩回
    374: "714373",  # //货叉#6仓高位伸出时前电插头未缩回
    375: "714374",  # //货叉#6仓高位伸出时后电插头未缩回
    376: "714375",  # //货叉#6仓高位伸出时仓内有电池NPA传感器触发
    377: "714376",  # //货叉#6仓高位伸出时仓内有电池NPD传感器触发
    378: "714377",  # //货叉#6仓高位伸出时仓内有电池到位传感器触发
    379: "714378",  # //货叉#6仓低位伸出货叉有电池
    380: "714379",  # //货叉#7仓伸出时堆垛机升降未在对接位
    381: "714380",  # //货叉#7仓高位伸出时左水插头未缩回
    382: "714381",  # //货叉#7仓高位伸出时右水插头未缩回
    383: "714382",  # //货叉#7仓高位伸出时前电插头未缩回
    384: "714383",  # //货叉#7仓高位伸出时后电插头未缩回
    385: "714384",  # //货叉#7仓高位伸出时仓内有电池NPA传感器触发
    386: "714385",  # //货叉#7仓高位伸出时仓内有电池NPD传感器触发
    387: "714386",  # //货叉#7仓高位伸出时仓内有电池到位传感器触发
    388: "714387",  # //货叉#7仓低位伸出货叉有电池
    389: "714388",  # //货叉#8仓伸出时堆垛机升降未在对接位
    390: "714389",  # //货叉#8仓高位伸出时左水插头未缩回
    391: "714390",  # //货叉#8仓高位伸出时右水插头未缩回
    392: "714391",  # //货叉#8仓高位伸出时前电插头未缩回
    393: "714392",  # //货叉#8仓高位伸出时后电插头未缩回
    394: "714393",  # //货叉#8仓高位伸出时仓内有电池NPA传感器触发
    395: "714394",  # //货叉#8仓高位伸出时仓内有电池NPD传感器触发
    396: "714395",  # //货叉#8仓高位伸出时仓内有电池到位传感器触发
    397: "714396",  # //货叉#8仓低位伸出货叉有电池
    398: "714397",  # //货叉#9仓伸出时堆垛机升降未在对接位
    399: "714398",  # //货叉#9仓高位伸出时左水插头未缩回
    400: "714399",  # //货叉#9仓高位伸出时右水插头未缩回
    401: "714400",  # //货叉#9仓高位伸出时前电插头未缩回
    402: "714401",  # //货叉#9仓高位伸出时后电插头未缩回
    403: "714402",  # //货叉#9仓高位伸出时仓内有电池NPA传感器触发
    404: "714403",  # //货叉#9仓高位伸出时仓内有电池NPD传感器触发
    405: "714404",  # //货叉#9仓高位伸出时仓内有电池到位传感器触发
    406: "714405",  # //货叉#9仓低位伸出货叉有电池
    407: "714406",  # //货叉#10仓伸出时堆垛机升降未在对接位
    408: "714407",  # //货叉#10仓高位伸出时左水插头未缩回
    409: "714408",  # //货叉#10仓高位伸出时右水插头未缩回
    410: "714409",  # //货叉#10仓高位伸出时前电插头未缩回
    411: "714410",  # //货叉#10仓高位伸出时后电插头未缩回
    412: "714411",  # //货叉#10仓高位伸出时仓内有电池NPA传感器触发
    413: "714412",  # //货叉#10仓高位伸出时仓内有电池NPD传感器触发
    414: "714413",  # //货叉#10仓高位伸出时仓内有电池到位传感器触发
    415: "714414",  # //货叉#10仓低位伸出货叉有电池
    416: "714415",  # //货叉#11仓伸出时堆垛机升降未在对接位
    417: "714416",  # //货叉#11仓高位伸出时左水插头未缩回
    418: "714417",  # //货叉#11仓高位伸出时右水插头未缩回
    419: "714418",  # //货叉#11仓高位伸出时前电插头未缩回
    420: "714419",  # //货叉#11仓高位伸出时后电插头未缩回
    421: "714420",  # //货叉#11仓高位伸出时仓内有电池NPA传感器触发
    422: "714421",  # //货叉#11仓高位伸出时仓内有电池NPD传感器触发
    423: "714422",  # //货叉#11仓高位伸出时仓内有电池到位传感器触发
    424: "714423",  # //货叉#11仓低位伸出货叉有电池
    425: "714424",  # //货叉#12仓伸出时堆垛机升降未在对接位
    426: "714425",  # //货叉#12仓高位伸出时左水插头未缩回
    427: "714426",  # //货叉#12仓高位伸出时右水插头未缩回
    428: "714427",  # //货叉#12仓高位伸出时前电插头未缩回
    429: "714428",  # //货叉#12仓高位伸出时后电插头未缩回
    430: "714429",  # //货叉#12仓高位伸出时仓内有电池NPA传感器触发
    431: "714430",  # //货叉#12仓高位伸出时仓内有电池NPD传感器触发
    432: "714431",  # //货叉#12仓高位伸出时仓内有电池到位传感器触发
    433: "714432",  # //货叉#12仓低位伸出货叉有电池
    434: "714433",  # //货叉#13仓伸出时堆垛机升降未在对接位
    435: "714434",  # //货叉#13仓高位伸出时左水插头未缩回
    436: "714435",  # //货叉#13仓高位伸出时右水插头未缩回
    437: "714436",  # //货叉#13仓高位伸出时前电插头未缩回
    438: "714437",  # //货叉#13仓高位伸出时后电插头未缩回
    439: "714438",  # //货叉#13仓高位伸出时仓内有电池NPA传感器触发
    440: "714439",  # //货叉#13仓高位伸出时仓内有电池NPD传感器触发
    441: "714440",  # //货叉#13仓高位伸出时仓内有电池到位传感器触发
    442: "714441",  # //货叉#13仓低位伸出货叉有电池
    443: "714442",  # //货叉#14仓伸出时堆垛机升降未在对接位
    444: "714443",  # //货叉#14仓高位伸出时左水插头未缩回
    445: "714444",  # //货叉#14仓高位伸出时右水插头未缩回
    446: "714445",  # //货叉#14仓高位伸出时前电插头未缩回
    447: "714446",  # //货叉#14仓高位伸出时后电插头未缩回
    448: "714447",  # //货叉#14仓高位伸出时仓内有电池NPA传感器触发
    449: "714448",  # //货叉#14仓高位伸出时仓内有电池NPD传感器触发
    450: "714449",  # //货叉#14仓高位伸出时仓内有电池到位传感器触发
    451: "714450",  # //货叉#14仓低位伸出货叉有电池
    452: "714451",  # //货叉#15仓伸出时堆垛机升降未在对接位
    453: "714452",  # //货叉#15仓高位伸出时左水插头未缩回
    454: "714453",  # //货叉#15仓高位伸出时右水插头未缩回
    455: "714454",  # //货叉#15仓高位伸出时前电插头未缩回
    456: "714455",  # //货叉#15仓高位伸出时后电插头未缩回
    457: "714456",  # //货叉#15仓高位伸出时仓内有电池NPA传感器触发
    458: "714457",  # //货叉#15仓高位伸出时仓内有电池NPD传感器触发
    459: "714458",  # //货叉#15仓高位伸出时仓内有电池到位传感器触发
    460: "714459",  # //货叉#15仓低位伸出货叉有电池
    461: "714460",  # //货叉#16仓伸出时堆垛机升降未在对接位
    462: "714461",  # //货叉#16仓高位伸出时左水插头未缩回
    463: "714462",  # //货叉#16仓高位伸出时右水插头未缩回
    464: "714463",  # //货叉#16仓高位伸出时前电插头未缩回
    465: "714464",  # //货叉#16仓高位伸出时后电插头未缩回
    466: "714465",  # //货叉#16仓高位伸出时仓内有电池NPA传感器触发
    467: "714466",  # //货叉#16仓高位伸出时仓内有电池NPD传感器触发
    468: "714467",  # //货叉#16仓高位伸出时仓内有电池到位传感器触发
    469: "714468",  # //货叉#16仓低位伸出货叉有电池
    470: "714469",  # //货叉#17仓伸出时堆垛机升降未在对接位
    471: "714470",  # //货叉#17仓高位伸出时左水插头未缩回
    472: "714471",  # //货叉#17仓高位伸出时右水插头未缩回
    473: "714472",  # //货叉#17仓高位伸出时前电插头未缩回
    474: "714473",  # //货叉#17仓高位伸出时后电插头未缩回
    475: "714474",  # //货叉#17仓高位伸出时仓内有电池NPA传感器触发
    476: "714475",  # //货叉#17仓高位伸出时仓内有电池NPD传感器触发
    477: "714476",  # //货叉#17仓高位伸出时仓内有电池到位传感器触发
    478: "714477",  # //货叉#17仓低位伸出货叉有电池
    479: "714478",  # //货叉#18仓伸出时堆垛机升降未在对接位
    480: "714479",  # //货叉#18仓高位伸出时左水插头未缩回
    481: "714480",  # //货叉#18仓高位伸出时右水插头未缩回
    482: "714481",  # //货叉#18仓高位伸出时前电插头未缩回
    483: "714482",  # //货叉#18仓高位伸出时后电插头未缩回
    484: "714483",  # //货叉#18仓高位伸出时仓内有电池NPA传感器触发
    485: "714484",  # //货叉#18仓高位伸出时仓内有电池NPD传感器触发
    486: "714485",  # //货叉#18仓高位伸出时仓内有电池到位传感器触发
    487: "714486",  # //货叉#18仓低位伸出货叉有电池
    488: "714487",  # //货叉#19仓伸出时堆垛机升降未在对接位
    489: "714488",  # //货叉#19仓高位伸出时左水插头未缩回
    490: "714489",  # //货叉#19仓高位伸出时右水插头未缩回
    491: "714490",  # //货叉#19仓高位伸出时前电插头未缩回
    492: "714491",  # //货叉#19仓高位伸出时后电插头未缩回
    493: "714492",  # //货叉#19仓高位伸出时仓内有电池NPA传感器触发
    494: "714493",  # //货叉#19仓高位伸出时仓内有电池NPD传感器触发
    495: "714494",  # //货叉#19仓高位伸出时仓内有电池到位传感器触发
    496: "714495",  # //货叉#19仓低位伸出货叉有电池
    497: "714496",  # //货叉#20仓伸出时堆垛机升降未在对接位
    498: "714497",  # //货叉#20仓高位伸出时左水插头未缩回
    499: "714498",  # //货叉#20仓高位伸出时右水插头未缩回
    500: "714499",  # //货叉#20仓高位伸出时前电插头未缩回
    501: "714500",  # //货叉#20仓高位伸出时后电插头未缩回
    502: "714501",  # //货叉#20仓高位伸出时仓内有电池NPA传感器触发
    503: "714502",  # //货叉#20仓高位伸出时仓内有电池NPD传感器触发
    504: "714503",  # //货叉#20仓高位伸出时仓内有电池到位传感器触发
    505: "714504",  # //货叉#20仓低位伸出货叉有电池
    506: "714505",  # //货叉#21仓伸出时堆垛机升降未在对接位
    507: "714506",  # //货叉#21仓高位伸出时前电插头未缩回
    508: "714507",  # //货叉#21仓高位伸出时后电插头未缩回
    509: "714508",  # //货叉#21仓高位伸出时仓内有电池NPA传感器触发
    510: "714509",  # //货叉#21仓高位伸出时仓内有电池NPD传感器触发
    511: "714510",  # //货叉#21仓高位伸出时仓内有电池到位传感器触发
    512: "714511",  # //货叉#21仓低位伸出货叉有电池
    513: "714512",  # //货叉#22仓伸出时堆垛机升降未在对接位
    514: "714513",  # //货叉#22仓高位伸出时仓内有电池NPA传感器触发
    515: "714514",  # //货叉#22仓高位伸出时仓内有电池NPD传感器触发
    516: "714515",  # //货叉#22仓高位伸出时仓内有电池到位传感器触发
    517: "714516",  # //货叉#22仓低位伸出货叉有电池
    518: "714517",  # //货叉伸出时堆垛机升降未在升降仓对接位
    519: "714518",  # //货叉在升降仓高位伸出时升降仓上有电池前到位传感器触发
    520: "714519",  # //货叉在升降仓高位伸出时升降仓上有电池后到位传感器触发
    521: "714520",  # //货叉在升降仓低位伸出时货叉有电池
    522: "714521",  # //货叉伸出时升降仓未在工作位
    523: "714522",  # //货叉左伸出超时
    524: "714523",  # //货叉右伸出超时
    525: "714524",  # //货叉#1仓缩回时堆垛机升降未在对接位
    526: "714525",  # //货叉#1仓高位缩回时左水插头未缩回
    527: "714526",  # //货叉#1仓高位缩回时右水插头未缩回
    528: "714527",  # //货叉#1仓高位缩回时前电插头未缩回
    529: "714528",  # //货叉#1仓高位缩回时后电插头未缩回
    530: "714529",  # //货叉缩回时堆垛机平移未在前仓
    531: "714530",  # //货叉缩回时堆垛机平移未在后仓
    532: "714531",  # //货叉缩回时堆垛机平移未在升降仓
    533: "714532",  # //货叉#2仓缩回时堆垛机升降未在对接位
    534: "714533",  # //货叉#2仓高位缩回时左水插头未缩回
    535: "714534",  # //货叉#2仓高位缩回时右水插头未缩回
    536: "714535",  # //货叉#2仓高位缩回时前电插头未缩回
    537: "714536",  # //货叉#2仓高位缩回时后电插头未缩回
    538: "714537",  # //货叉#3仓缩回时堆垛机升降未在对接位
    539: "714538",  # //货叉#3仓高位缩回时左水插头未缩回
    540: "714539",  # //货叉#3仓高位缩回时右水插头未缩回
    541: "714540",  # //货叉#3仓高位缩回时前电插头未缩回
    542: "714541",  # //货叉#3仓高位缩回时后电插头未缩回
    543: "714542",  # //货叉#4仓缩回时堆垛机升降未在对接位
    544: "714543",  # //货叉#4仓高位缩回时左水插头未缩回
    545: "714544",  # //货叉#4仓高位缩回时右水插头未缩回
    546: "714545",  # //货叉#4仓高位缩回时前电插头未缩回
    547: "714546",  # //货叉#4仓高位缩回时后电插头未缩回
    548: "714547",  # //货叉#5仓缩回时堆垛机升降未在对接位
    549: "714548",  # //货叉#5仓高位缩回时左水插头未缩回
    550: "714549",  # //货叉#5仓高位缩回时右水插头未缩回
    551: "714550",  # //货叉#5仓高位缩回时前电插头未缩回
    552: "714551",  # //货叉#5仓高位缩回时后电插头未缩回
    553: "714552",  # //货叉#6仓缩回时堆垛机升降未在对接位
    554: "714553",  # //货叉#6仓高位缩回时左水插头未缩回
    555: "714554",  # //货叉#6仓高位缩回时右水插头未缩回
    556: "714555",  # //货叉#6仓高位缩回时前电插头未缩回
    557: "714556",  # //货叉#6仓高位缩回时后电插头未缩回
    558: "714557",  # //货叉#7仓缩回时堆垛机升降未在对接位
    559: "714558",  # //货叉#7仓高位缩回时左水插头未缩回
    560: "714559",  # //货叉#7仓高位缩回时右水插头未缩回
    561: "714560",  # //货叉#7仓高位缩回时前电插头未缩回
    562: "714561",  # //货叉#7仓高位缩回时后电插头未缩回
    563: "714562",  # //货叉#8仓缩回时堆垛机升降未在对接位
    564: "714563",  # //货叉#8仓高位缩回时左水插头未缩回
    565: "714564",  # //货叉#8仓高位缩回时右水插头未缩回
    566: "714565",  # //货叉#8仓高位缩回时前电插头未缩回
    567: "714566",  # //货叉#8仓高位缩回时后电插头未缩回
    568: "714567",  # //货叉#9仓缩回时堆垛机升降未在对接位
    569: "714568",  # //货叉#9仓高位缩回时左水插头未缩回
    570: "714569",  # //货叉#9仓高位缩回时右水插头未缩回
    571: "714570",  # //货叉#9仓高位缩回时前电插头未缩回
    572: "714571",  # //货叉#9仓高位缩回时后电插头未缩回
    573: "714572",  # //货叉#10仓缩回时堆垛机升降未在对接位
    574: "714573",  # //货叉#10仓高位缩回时左水插头未缩回
    575: "714574",  # //货叉#10仓高位缩回时右水插头未缩回
    576: "714575",  # //货叉#10仓高位缩回时前电插头未缩回
    577: "714576",  # //货叉#10仓高位缩回时后电插头未缩回
    578: "714577",  # //货叉#11仓缩回时堆垛机升降未在对接位
    579: "714578",  # //货叉#11仓高位缩回时左水插头未缩回
    580: "714579",  # //货叉#11仓高位缩回时右水插头未缩回
    581: "714580",  # //货叉#11仓高位缩回时前电插头未缩回
    582: "714581",  # //货叉#11仓高位缩回时后电插头未缩回
    583: "714582",  # //货叉#12仓缩回时堆垛机升降未在对接位
    584: "714583",  # //货叉#12仓高位缩回时左水插头未缩回
    585: "714584",  # //货叉#12仓高位缩回时右水插头未缩回
    586: "714585",  # //货叉#12仓高位缩回时前电插头未缩回
    587: "714586",  # //货叉#12仓高位缩回时后电插头未缩回
    588: "714587",  # //货叉#13仓缩回时堆垛机升降未在对接位
    589: "714588",  # //货叉#13仓高位缩回时左水插头未缩回
    590: "714589",  # //货叉#13仓高位缩回时右水插头未缩回
    591: "714590",  # //货叉#13仓高位缩回时前电插头未缩回
    592: "714591",  # //货叉#13仓高位缩回时后电插头未缩回
    593: "714592",  # //货叉#14仓缩回时堆垛机升降未在对接位
    594: "714593",  # //货叉#14仓高位缩回时左水插头未缩回
    595: "714594",  # //货叉#14仓高位缩回时右水插头未缩回
    596: "714595",  # //货叉#14仓高位缩回时前电插头未缩回
    597: "714596",  # //货叉#14仓高位缩回时后电插头未缩回
    598: "714597",  # //货叉#15仓缩回时堆垛机升降未在对接位
    599: "714598",  # //货叉#15仓高位缩回时左水插头未缩回
    600: "714599",  # //货叉#15仓高位缩回时右水插头未缩回
    601: "714600",  # //货叉#15仓高位缩回时前电插头未缩回
    602: "714601",  # //货叉#15仓高位缩回时后电插头未缩回
    603: "714602",  # //货叉#16仓缩回时堆垛机升降未在对接位
    604: "714603",  # //货叉#16仓高位缩回时左水插头未缩回
    605: "714604",  # //货叉#16仓高位缩回时右水插头未缩回
    606: "714605",  # //货叉#16仓高位缩回时前电插头未缩回
    607: "714606",  # //货叉#16仓高位缩回时后电插头未缩回
    608: "714607",  # //货叉#17仓缩回时堆垛机升降未在对接位
    609: "714608",  # //货叉#17仓高位缩回时左水插头未缩回
    610: "714609",  # //货叉#17仓高位缩回时右水插头未缩回
    611: "714610",  # //货叉#17仓高位缩回时前电插头未缩回
    612: "714611",  # //货叉#17仓高位缩回时后电插头未缩回
    613: "714612",  # //货叉#18仓缩回时堆垛机升降未在对接位
    614: "714613",  # //货叉#18仓高位缩回时左水插头未缩回
    615: "714614",  # //货叉#18仓高位缩回时右水插头未缩回
    616: "714615",  # //货叉#18仓高位缩回时前电插头未缩回
    617: "714616",  # //货叉#18仓高位缩回时后电插头未缩回
    618: "714617",  # //货叉#19仓缩回时堆垛机升降未在对接位
    619: "714618",  # //货叉#19仓高位缩回时左水插头未缩回
    620: "714619",  # //货叉#19仓高位缩回时右水插头未缩回
    621: "714620",  # //货叉#19仓高位缩回时前电插头未缩回
    622: "714621",  # //货叉#19仓高位缩回时后电插头未缩回
    623: "714622",  # //货叉#20仓缩回时堆垛机升降未在对接位
    624: "714623",  # //货叉#20仓高位缩回时左水插头未缩回
    625: "714624",  # //货叉#20仓高位缩回时右水插头未缩回
    626: "714625",  # //货叉#20仓高位缩回时前电插头未缩回
    627: "714626",  # //货叉#20仓高位缩回时后电插头未缩回
    628: "714627",  # //货叉#21仓缩回时堆垛机升降未在对接位
    629: "714628",  # //货叉#21仓高位缩回时前电插头未缩回
    630: "714629",  # //货叉#21仓高位缩回时后电插头未缩回
    631: "714630",  # //货叉#22仓缩回时堆垛机升降未在对接位
    632: "714631",  # //货叉缩回时堆垛机升降未升降仓对接位
    633: "714632",  # //货叉缩回时升降仓未在工作位
    634: "714633",  # //货叉缩回超时
    635: "714634",  # //#1仓左水插头伸出超时
    636: "714635",  # //#1仓左水插头伸出时仓内无电池
    637: "714636",  # //#1仓左水插头伸出时电池类型不匹配
    638: "714637",  # //#1仓左水插头缩回超时
    639: "714638",  # //#2仓左水插头伸出超时
    640: "714639",  # //#2仓左水插头伸出时仓内无电池
    641: "714640",  # //#2仓左水插头伸出时电池类型不匹配
    642: "714641",  # //#2仓左水插头缩回超时
    643: "714642",  # //#3仓左水插头伸出超时
    644: "714643",  # //#3仓左水插头伸出时仓内无电池
    645: "714644",  # //#3仓左水插头伸出时电池类型不匹配
    646: "714645",  # //#3仓左水插头缩回超时
    647: "714646",  # //#4仓左水插头伸出超时
    648: "714647",  # //#4仓左水插头伸出时仓内无电池
    649: "714648",  # //#4仓左水插头伸出时电池类型不匹配
    650: "714649",  # //#4仓左水插头缩回超时
    651: "714650",  # //#5仓左水插头伸出超时
    652: "714651",  # //#5仓左水插头伸出时仓内无电池
    653: "714652",  # //#5仓左水插头伸出时电池类型不匹配
    654: "714653",  # //#5仓左水插头缩回超时
    655: "714654",  # //#6仓左水插头伸出超时
    656: "714655",  # //#6仓左水插头伸出时仓内无电池
    657: "714656",  # //#6仓左水插头伸出时电池类型不匹配
    658: "714657",  # //#6仓左水插头缩回超时
    659: "714658",  # //#7仓左水插头伸出超时
    660: "714659",  # //#7仓左水插头伸出时仓内无电池
    661: "714660",  # //#7仓左水插头伸出时电池类型不匹配
    662: "714661",  # //#7仓左水插头缩回超时
    663: "714662",  # //#8仓左水插头伸出超时
    664: "714663",  # //#8仓左水插头伸出时仓内无电池
    665: "714664",  # //#8仓左水插头伸出时电池类型不匹配
    666: "714665",  # //#8仓左水插头缩回超时
    667: "714666",  # //#9仓左水插头伸出超时
    668: "714667",  # //#9仓左水插头伸出时仓内无电池
    669: "714668",  # //#9仓左水插头伸出时电池类型不匹配
    670: "714669",  # //#9仓左水插头缩回超时
    671: "714670",  # //#10仓左水插头伸出超时
    672: "714671",  # //#10仓左水插头伸出时仓内无电池
    673: "714672",  # //#10仓左水插头伸出时电池类型不匹配
    674: "714673",  # //#10仓左水插头缩回超时
    675: "714674",  # //#11仓左水插头伸出超时
    676: "714675",  # //#11仓左水插头伸出时仓内无电池
    677: "714676",  # //#11仓左水插头伸出时电池类型不匹配
    678: "714677",  # //#11仓左水插头缩回超时
    679: "714678",  # //#12仓左水插头伸出超时
    680: "714679",  # //#12仓左水插头伸出时仓内无电池
    681: "714680",  # //#12仓左水插头伸出时电池类型不匹配
    682: "714681",  # //#12仓左水插头缩回超时
    683: "714682",  # //#13仓左水插头伸出超时
    684: "714683",  # //#13仓左水插头伸出时仓内无电池
    685: "714684",  # //#13仓左水插头伸出时电池类型不匹配
    686: "714685",  # //#13仓左水插头缩回超时
    687: "714686",  # //#14仓左水插头伸出超时
    688: "714687",  # //#14仓左水插头伸出时仓内无电池
    689: "714688",  # //#14仓左水插头伸出时电池类型不匹配
    690: "714689",  # //#14仓左水插头缩回超时
    691: "714690",  # //#15仓左水插头伸出超时
    692: "714691",  # //#15仓左水插头伸出时仓内无电池
    693: "714692",  # //#15仓左水插头伸出时电池类型不匹配
    694: "714693",  # //#15仓左水插头缩回超时
    695: "714694",  # //#16仓左水插头伸出超时
    696: "714695",  # //#16仓左水插头伸出时仓内无电池
    697: "714696",  # //#16仓左水插头伸出时电池类型不匹配
    698: "714697",  # //#16仓左水插头缩回超时
    699: "714698",  # //#17仓左水插头伸出超时
    700: "714699",  # //#17仓左水插头伸出时仓内无电池
    701: "714700",  # //#17仓左水插头伸出时电池类型不匹配
    702: "714701",  # //#17仓左水插头缩回超时
    703: "714702",  # //#18仓左水插头伸出超时
    704: "714703",  # //#18仓左水插头伸出时仓内无电池
    705: "714704",  # //#18仓左水插头伸出时电池类型不匹配
    706: "714705",  # //#18仓左水插头缩回超时
    707: "714706",  # //#19仓左水插头伸出超时
    708: "714707",  # //#19仓左水插头伸出时仓内无电池
    709: "714708",  # //#19仓左水插头伸出时电池类型不匹配
    710: "714709",  # //#19仓左水插头缩回超时
    711: "714710",  # //#20仓左水插头伸出超时
    712: "714711",  # //#20仓左水插头伸出时仓内无电池
    713: "714712",  # //#20仓左水插头伸出时电池类型不匹配
    714: "714713",  # //#20仓左水插头缩回超时
    715: "714714",  # //#1仓右水插头伸出超时
    716: "714715",  # //#1仓右水插头伸出时仓内无电池
    717: "714716",  # //#1仓右水插头伸出时电池类型不匹配
    718: "714717",  # //#1仓右水插头缩回超时
    719: "714718",  # //#2仓右水插头伸出超时
    720: "714719",  # //#2仓右水插头伸出时仓内无电池
    721: "714720",  # //#2仓右水插头伸出时电池类型不匹配
    722: "714721",  # //#2仓右水插头缩回超时
    723: "714722",  # //#3仓右水插头伸出超时
    724: "714723",  # //#3仓右水插头伸出时仓内无电池
    725: "714724",  # //#3仓右水插头伸出时电池类型不匹配
    726: "714725",  # //#3仓右水插头缩回超时
    727: "714726",  # //#4仓右水插头伸出超时
    728: "714727",  # //#4仓右水插头伸出时仓内无电池
    729: "714728",  # //#4仓右水插头伸出时电池类型不匹配
    730: "714729",  # //#4仓右水插头缩回超时
    731: "714730",  # //#5仓右水插头伸出超时
    732: "714731",  # //#5仓右水插头伸出时仓内无电池
    733: "714732",  # //#5仓右水插头伸出时电池类型不匹配
    734: "714733",  # //#5仓右水插头缩回超时
    735: "714734",  # //#6仓右水插头伸出超时
    736: "714735",  # //#6仓右水插头伸出时仓内无电池
    737: "714736",  # //#6仓右水插头伸出时电池类型不匹配
    738: "714737",  # //#6仓右水插头缩回超时
    739: "714738",  # //#7仓右水插头伸出超时
    740: "714739",  # //#7仓右水插头伸出时仓内无电池
    741: "714740",  # //#7仓右水插头伸出时电池类型不匹配
    742: "714741",  # //#7仓右水插头缩回超时
    743: "714742",  # //#8仓右水插头伸出超时
    744: "714743",  # //#8仓右水插头伸出时仓内无电池
    745: "714744",  # //#8仓右水插头伸出时电池类型不匹配
    746: "714745",  # //#8仓右水插头缩回超时
    747: "714746",  # //#9仓右水插头伸出超时
    748: "714747",  # //#9仓右水插头伸出时仓内无电池
    749: "714748",  # //#9仓右水插头伸出时电池类型不匹配
    750: "714749",  # //#9仓右水插头缩回超时
    751: "714750",  # //#10仓右水插头伸出超时
    752: "714751",  # //#10仓右水插头伸出时仓内无电池
    753: "714752",  # //#10仓右水插头伸出时电池类型不匹配
    754: "714753",  # //#10仓右水插头缩回超时
    755: "714754",  # //#11仓右水插头伸出超时
    756: "714755",  # //#11仓右水插头伸出时仓内无电池
    757: "714756",  # //#11仓右水插头伸出时电池类型不匹配
    758: "714757",  # //#11仓右水插头缩回超时
    759: "714758",  # //#12仓右水插头伸出超时
    760: "714759",  # //#12仓右水插头伸出时仓内无电池
    761: "714760",  # //#12仓右水插头伸出时电池类型不匹配
    762: "714761",  # //#12仓右水插头缩回超时
    763: "714762",  # //#13仓右水插头伸出超时
    764: "714763",  # //#13仓右水插头伸出时仓内无电池
    765: "714764",  # //#13仓右水插头伸出时电池类型不匹配
    766: "714765",  # //#13仓右水插头缩回超时
    767: "714766",  # //#14仓右水插头伸出超时
    768: "714767",  # //#14仓右水插头伸出时仓内无电池
    769: "714768",  # //#14仓右水插头伸出时电池类型不匹配
    770: "714769",  # //#14仓右水插头缩回超时
    771: "714770",  # //#15仓右水插头伸出超时
    772: "714771",  # //#15仓右水插头伸出时仓内无电池
    773: "714772",  # //#15仓右水插头伸出时电池类型不匹配
    774: "714773",  # //#15仓右水插头缩回超时
    775: "714774",  # //#16仓右水插头伸出超时
    776: "714775",  # //#16仓右水插头伸出时仓内无电池
    777: "714776",  # //#16仓右水插头伸出时电池类型不匹配
    778: "714777",  # //#16仓右水插头缩回超时
    779: "714778",  # //#17仓右水插头伸出超时
    780: "714779",  # //#17仓右水插头伸出时仓内无电池
    781: "714780",  # //#17仓右水插头伸出时电池类型不匹配
    782: "714781",  # //#17仓右水插头缩回超时
    783: "714782",  # //#18仓右水插头伸出超时
    784: "714783",  # //#18仓右水插头伸出时仓内无电池
    785: "714784",  # //#18仓右水插头伸出时电池类型不匹配
    786: "714785",  # //#18仓右水插头缩回超时
    787: "714786",  # //#19仓右水插头伸出超时
    788: "714787",  # //#19仓右水插头伸出时仓内无电池
    789: "714788",  # //#19仓右水插头伸出时电池类型不匹配
    790: "714789",  # //#19仓右水插头缩回超时
    791: "714790",  # //#20仓右水插头伸出超时
    792: "714791",  # //#20仓右水插头伸出时仓内无电池
    793: "714792",  # //#20仓右水插头伸出时电池类型不匹配
    794: "714793",  # //#20仓右水插头缩回超时
    795: "714794",  # //#1仓前电插头伸出超时
    796: "714795",  # //#1仓前电插头伸出时仓内无电池
    797: "714796",  # //#1仓前电插头伸出时电池类型不匹配
    798: "714797",  # //#1仓前电插头缩回超时
    799: "714798",  # //#2仓前电插头伸出超时
    800: "714799",  # //#2仓前电插头伸出时仓内无电池
    801: "714800",  # //#2仓前电插头伸出时电池类型不匹配
    802: "714801",  # //#2仓前电插头缩回超时
    803: "714802",  # //#3仓前电插头伸出超时
    804: "714803",  # //#3仓前电插头伸出时仓内无电池
    805: "714804",  # //#3仓前电插头伸出时电池类型不匹配
    806: "714805",  # //#3仓前电插头缩回超时
    807: "714806",  # //#4仓前电插头伸出超时
    808: "714807",  # //#4仓前电插头伸出时仓内无电池
    809: "714808",  # //#4仓前电插头伸出时电池类型不匹配
    810: "714809",  # //#4仓前电插头缩回超时
    811: "714810",  # //#5仓前电插头伸出超时
    812: "714811",  # //#5仓前电插头伸出时仓内无电池
    813: "714812",  # //#5仓前电插头伸出时电池类型不匹配
    814: "714813",  # //#5仓前电插头缩回超时
    815: "714814",  # //#6仓前电插头伸出超时
    816: "714815",  # //#6仓前电插头伸出时仓内无电池
    817: "714816",  # //#6仓前电插头伸出时电池类型不匹配
    818: "714817",  # //#6仓前电插头缩回超时
    819: "714818",  # //#7仓前电插头伸出超时
    820: "714819",  # //#7仓前电插头伸出时仓内无电池
    821: "714820",  # //#7仓前电插头伸出时电池类型不匹配
    822: "714821",  # //#7仓前电插头缩回超时
    823: "714822",  # //#8仓前电插头伸出超时
    824: "714823",  # //#8仓前电插头伸出时仓内无电池
    825: "714824",  # //#8仓前电插头伸出时电池类型不匹配
    826: "714825",  # //#8仓前电插头缩回超时
    827: "714826",  # //#9仓前电插头伸出超时
    828: "714827",  # //#9仓前电插头伸出时仓内无电池
    829: "714828",  # //#9仓前电插头伸出时电池类型不匹配
    830: "714829",  # //#9仓前电插头缩回超时
    831: "714830",  # //#10仓前电插头伸出超时
    832: "714831",  # //#10仓前电插头伸出时仓内无电池
    833: "714832",  # //#10仓前电插头伸出时电池类型不匹配
    834: "714833",  # //#10仓前电插头缩回超时
    835: "714834",  # //#11仓前电插头伸出超时
    836: "714835",  # //#11仓前电插头伸出时仓内无电池
    837: "714836",  # //#11仓前电插头伸出时电池类型不匹配
    838: "714837",  # //#11仓前电插头缩回超时
    839: "714838",  # //#12仓前电插头伸出超时
    840: "714839",  # //#12仓前电插头伸出时仓内无电池
    841: "714840",  # //#12仓前电插头伸出时电池类型不匹配
    842: "714841",  # //#12仓前电插头缩回超时
    843: "714842",  # //#13仓前电插头伸出超时
    844: "714843",  # //#13仓前电插头伸出时仓内无电池
    845: "714844",  # //#13仓前电插头伸出时电池类型不匹配
    846: "714845",  # //#13仓前电插头缩回超时
    847: "714846",  # //#14仓前电插头伸出超时
    848: "714847",  # //#14仓前电插头伸出时仓内无电池
    849: "714848",  # //#14仓前电插头伸出时电池类型不匹配
    850: "714849",  # //#14仓前电插头缩回超时
    851: "714850",  # //#15仓前电插头伸出超时
    852: "714851",  # //#15仓前电插头伸出时仓内无电池
    853: "714852",  # //#15仓前电插头伸出时电池类型不匹配
    854: "714853",  # //#15仓前电插头缩回超时
    855: "714854",  # //#16仓前电插头伸出超时
    856: "714855",  # //#16仓前电插头伸出时仓内无电池
    857: "714856",  # //#16仓前电插头伸出时电池类型不匹配
    858: "714857",  # //#16仓前电插头缩回超时
    859: "714858",  # //#17仓前电插头伸出超时
    860: "714859",  # //#17仓前电插头伸出时仓内无电池
    861: "714860",  # //#17仓前电插头伸出时电池类型不匹配
    862: "714861",  # //#17仓前电插头缩回超时
    863: "714862",  # //#18仓前电插头伸出超时
    864: "714863",  # //#18仓前电插头伸出时仓内无电池
    865: "714864",  # //#18仓前电插头伸出时电池类型不匹配
    866: "714865",  # //#18仓前电插头缩回超时
    867: "714866",  # //#19仓前电插头伸出超时
    868: "714867",  # //#19仓前电插头伸出时仓内无电池
    869: "714868",  # //#19仓前电插头伸出时电池类型不匹配
    870: "714869",  # //#19仓前电插头缩回超时
    871: "714870",  # //#20仓前电插头伸出超时
    872: "714871",  # //#20仓前电插头伸出时仓内无电池
    873: "714872",  # //#20仓前电插头伸出时电池类型不匹配
    874: "714873",  # //#20仓前电插头缩回超时
    875: "714874",  # //#21仓前电插头伸出超时
    876: "714875",  # //#21仓前电插头伸出时仓内无电池
    877: "714876",  # //#21仓前电插头伸出时电池类型不匹配
    878: "714877",  # //#21仓前电插头缩回超时
    879: "714878",  # //#1仓后电插头伸出超时
    880: "714879",  # //#1仓后电插头伸出时仓内无电池
    881: "714880",  # //#1仓后电插头伸出时电池类型不匹配
    882: "714881",  # //#1仓后电插头缩回超时
    883: "714882",  # //#2仓后电插头伸出超时
    884: "714883",  # //#2仓后电插头伸出时仓内无电池
    885: "714884",  # //#2仓后电插头伸出时电池类型不匹配
    886: "714885",  # //#2仓后电插头缩回超时
    887: "714886",  # //#3仓后电插头伸出超时
    888: "714887",  # //#3仓后电插头伸出时仓内无电池
    889: "714888",  # //#3仓后电插头伸出时电池类型不匹配
    890: "714889",  # //#3仓后电插头缩回超时
    891: "714890",  # //#4仓后电插头伸出超时
    892: "714891",  # //#4仓后电插头伸出时仓内无电池
    893: "714892",  # //#4仓后电插头伸出时电池类型不匹配
    894: "714893",  # //#4仓后电插头缩回超时
    895: "714894",  # //#5仓后电插头伸出超时
    896: "714895",  # //#5仓后电插头伸出时仓内无电池
    897: "714896",  # //#5仓后电插头伸出时电池类型不匹配
    898: "714897",  # //#5仓后电插头缩回超时
    899: "714898",  # //#6仓后电插头伸出超时
    900: "714899",  # //#6仓后电插头伸出时仓内无电池
    901: "714900",  # //#6仓后电插头伸出时电池类型不匹配
    902: "714901",  # //#6仓后电插头缩回超时
    903: "714902",  # //#7仓后电插头伸出超时
    904: "714903",  # //#7仓后电插头伸出时仓内无电池
    905: "714904",  # //#7仓后电插头伸出时电池类型不匹配
    906: "714905",  # //#7仓后电插头缩回超时
    907: "714906",  # //#8仓后电插头伸出超时
    908: "714907",  # //#8仓后电插头伸出时仓内无电池
    909: "714908",  # //#8仓后电插头伸出时电池类型不匹配
    910: "714909",  # //#8仓后电插头缩回超时
    911: "714910",  # //#9仓后电插头伸出超时
    912: "714911",  # //#9仓后电插头伸出时仓内无电池
    913: "714912",  # //#9仓后电插头伸出时电池类型不匹配
    914: "714913",  # //#9仓后电插头缩回超时
    915: "714914",  # //#10仓后电插头伸出超时
    916: "714915",  # //#10仓后电插头伸出时仓内无电池
    917: "714916",  # //#10仓后电插头伸出时电池类型不匹配
    918: "714917",  # //#10仓后电插头缩回超时
    919: "714918",  # //#11仓后电插头伸出超时
    920: "714919",  # //#11仓后电插头伸出时仓内无电池
    921: "714920",  # //#11仓后电插头伸出时电池类型不匹配
    922: "714921",  # //#11仓后电插头缩回超时
    923: "714922",  # //#12仓后电插头伸出超时
    924: "714923",  # //#12仓后电插头伸出时仓内无电池
    925: "714924",  # //#12仓后电插头伸出时电池类型不匹配
    926: "714925",  # //#12仓后电插头缩回超时
    927: "714926",  # //#13仓后电插头伸出超时
    928: "714927",  # //#13仓后电插头伸出时仓内无电池
    929: "714928",  # //#13仓后电插头伸出时电池类型不匹配
    930: "714929",  # //#13仓后电插头缩回超时
    931: "714930",  # //#14仓后电插头伸出超时
    932: "714931",  # //#14仓后电插头伸出时仓内无电池
    933: "714932",  # //#14仓后电插头伸出时电池类型不匹配
    934: "714933",  # //#14仓后电插头缩回超时
    935: "714934",  # //#15仓后电插头伸出超时
    936: "714935",  # //#15仓后电插头伸出时仓内无电池
    937: "714936",  # //#15仓后电插头伸出时电池类型不匹配
    938: "714937",  # //#15仓后电插头缩回超时
    939: "714938",  # //#16仓后电插头伸出超时
    940: "714939",  # //#16仓后电插头伸出时仓内无电池
    941: "714940",  # //#16仓后电插头伸出时电池类型不匹配
    942: "714941",  # //#16仓后电插头缩回超时
    943: "714942",  # //#17仓后电插头伸出超时
    944: "714943",  # //#17仓后电插头伸出时仓内无电池
    945: "714944",  # //#17仓后电插头伸出时电池类型不匹配
    946: "714945",  # //#17仓后电插头缩回超时
    947: "714946",  # //#18仓后电插头伸出超时
    948: "714947",  # //#18仓后电插头伸出时仓内无电池
    949: "714948",  # //#18仓后电插头伸出时电池类型不匹配
    950: "714949",  # //#18仓后电插头缩回超时
    951: "714950",  # //#19仓后电插头伸出超时
    952: "714951",  # //#19仓后电插头伸出时仓内无电池
    953: "714952",  # //#19仓后电插头伸出时电池类型不匹配
    954: "714953",  # //#19仓后电插头缩回超时
    955: "714954",  # //#20仓后电插头伸出超时
    956: "714955",  # //#20仓后电插头伸出时仓内无电池
    957: "714956",  # //#20仓后电插头伸出时电池类型不匹配
    958: "714957",  # //#20仓后电插头缩回超时
    959: "714958",  # //#21仓后电插头伸出超时
    960: "714959",  # //#21仓后电插头伸出时仓内无电池
    961: "714960",  # //#21仓后电插头伸出时电池类型不匹配
    962: "714961",  # //#21仓后电插头缩回超时
    963: "714962",  # //升降仓至零点位超时
    964: "714963",  # //升降仓至零点位时升降仓前安全传感器被触发
    965: "714964",  # //升降仓至零点位时升降仓后安全传感器被触发
    966: "714965",  # //升降仓至零点位时货叉未在零点或未伸出到位
    967: "714966",  # //升降仓至工作位超时
    968: "714967",  # //升降仓至工作位时升降仓前安全传感器被触发
    969: "714968",  # //升降仓至工作位时升降仓后安全传感器被触发
    970: "714969",  # //升降仓至工作位时货叉未缩回
    971: "714970",  # //消防仓前挡板缩回超时
    972: "714971",  # //消防仓前挡板伸出超时
    973: "714972",  # //消防仓后挡板缩回超时
    974: "714973",  # //消防仓后挡板伸出超时
    975: "714974",  # //电池从升降仓运转至右缓存位超时前到位传感器未触发
    976: "714975",  # //电池从升降仓运转至右缓存位超时后到位传感器未触发
    977: "714976",  # //电池从升降仓运转至右缓存位时升降仓未在零点位
    978: "714977",  # //电池从升降仓运转至右缓存位时右缓存位前挡块未伸出
    979: "714978",  # //电池从升降仓运转至右缓存位时右缓存位后挡块未伸出
    980: "714979",  # //电池从右缓存位运转至停车平台超时前到位传感器未触发
    981: "714980",  # //电池从右缓存位运转至停车平台超时后到位传感器未触发
    982: "714981",  # //电池从右缓存位运转至停车平台时停车前挡块未伸出
    983: "714982",  # //电池从右缓存位运转至停车平台时停车后挡块未伸出
    984: "714983",  # //电池从右缓存位运转至停车平台时左前车身定位销未缩回
    985: "714984",  # //电池从右缓存位运转至停车平台时右后车身定位销未缩回
    986: "714985",  # //电池从右缓存位运转至停车平台时左后车身定位销未缩回
    987: "714986",  # //电池从右缓存位运转至停车平台时加解锁平台升降未在零点位
    988: "714987",  # //电池从右缓存位运转至停车平台时停车平台前导向条未伸出
    989: "714988",  # //电池从右缓存位运转至停车平台时停车平台后导向条未伸出
    990: "714989",  # //电池从右缓存位运转至停车平台时加解锁平台平移未在工作位
    991: "714990",  # //电池从停车平台运转至左缓存位超时前到位传感器未触发
    992: "714991",  # //电池从停车平台运转至左缓存位超时后到位传感器未触发
    993: "714992",  # //电池从停车平台运转至左缓存位时加解锁平台升降未在零点位
    994: "714993",  # //电池从停车平台运转至左缓存位时停车平台前挡块未缩回
    995: "714994",  # //电池从停车平台运转至左缓存位时停车平台后挡块未缩回
    996: "714995",  # //电池从停车平台运转至左缓存位时停车平台前导向条未伸出
    997: "714996",  # //电池从停车平台运转至左缓存位时停车平台后导向条未伸出
    998: "714997",  # //电池从停车平台运转至左缓存位时加解锁平台平移未在工作位
    999: "714998",  # //电池从停车平台运转至左缓存位时左前车身定位销未缩回
    1000: "714999",  # //电池从停车平台运转至左缓存位时右后车身定位销未缩回
    1001: "715000",  # // PLC电池从停车平台运转至左缓存位时左后车身定位销未缩回
    1002: "715001",  # // PLC电池从左缓存位运转至接驳位超时前到位传感器未触发
    1003: "715002",  # // PLC电池从左缓存位运转至接驳位超时后到位传感器未触发
    1004: "715003",  # // PLC电池从左缓存位运转至接驳位时加解锁平台升降未在零点位
    1005: "715004",  # // PLC电池从左缓存位运转至接驳位时接驳位未在零点位
    1006: "715005",  # // PLC电池从左缓存位运转至接驳位时左前车身定位销未缩回
    1007: "715006",  # // PLC电池从左缓存位运转至接驳位时右后车身定位销未缩回
    1008: "715007",  # // PLC电池从左缓存位运转至接驳位时左后车身定位销未缩回
    1009: "715008",  # // PLC电池从左缓存位运转至接驳位时停车平台前挡块未缩回
    1010: "715009",  # // PLC电池从左缓存位运转至接驳位时停车平台后挡块未缩回
    1011: "715010",  # // PLC电池从左缓存位运转至接驳位时停车平台前导向条未伸出
    1012: "715011",  # // PLC电池从左缓存位运转至接驳位时停车平台后导向条未伸出
    1013: "715012",  # // PLC电池从左缓存位运转至接驳位时加解锁平台平移未在工作位
    1014: "715013",  # // PLC电池从左缓存位运转至接驳位时货叉未缩回
    1015: "715014",  # // PLC电池从左缓存位运转至接驳位时右缓存位前挡块未缩回
    1016: "715015",  # // PLC电池从左缓存位运转至接驳位时右缓存位后挡块未缩回
    1017: "715016",  # // PLC电池从停车平台运转至接驳位超时前到位传感器未触发
    1018: "715017",  # // PLC电池从停车平台运转至接驳位超时后到位传感器未触发
    1019: "715018",  # // PLC电池从停车平台运转至接驳位时加解锁平台升降未在零点位
    1020: "715019",  # // PLC电池从停车平台运转至接驳位时接驳位未在零点位
    1021: "715020",  # // PLC电池从停车平台运转至接驳位时左前车身定位销未缩回
    1022: "715021",  # // PLC电池从停车平台运转至接驳位时右后车身定位销未缩回
    1023: "715022",  # // PLC电池从停车平台运转至接驳位时左后车身定位销未缩回
    1024: "715023",  # // PLC电池从停车平台运转至接驳位时停车平台前导向条未伸出
    1025: "715024",  # // PLC电池从停车平台运转至接驳位时停车平台后导向条未伸出
    1026: "715025",  # // PLC电池从停车平台运转至接驳位时加解锁平台平移未在工作位
    1027: "715026",  # // PLC电池从停车平台运转至接驳位时货叉未缩回
    1028: "715027",  # // PLC电池从停车平台运转至接驳位时右缓存位前挡块未缩回
    1029: "715028",  # // PLC电池从停车平台运转至接驳位时右缓存位后挡块未缩回
    1030: "715029",  # // PLC电池从右缓存位运转至接驳位超时前到位传感器未触发
    1031: "715030",  # // PLC电池从右缓存位运转至接驳位超时后到位传感器未触发
    1032: "715031",  # // PLC电池从右缓存位运转至接驳位时接驳位未在零点位
    1033: "715032",  # // PLC电池从右缓存位运转至接驳位时货叉未缩回
    1034: "715033",  # // PLC车辆加锁时加解锁平台升降未在工作位
    1035: "715034",  # // PLC车辆解锁时加解锁平台升降未在工作位
    1036: "715035",  # // PLC#1轴加锁故障E12
    1037: "715036",  # // PLC#1轴加锁故障E14
    1038: "715037",  # // PLC#1轴加锁故障E11
    1039: "715038",  # // PLC#1轴加锁故障E13
    1040: "715039",  # // PLC#1轴解锁故障E02
    1041: "715040",  # // PLC#1轴解锁故障E04
    1042: "715041",  # // PLC#1轴解锁故障E01
    1043: "715042",  # // PLC#2轴加锁故障E12
    1044: "715043",  # // PLC#2轴加锁故障E14
    1045: "715044",  # // PLC#2轴加锁故障E11
    1046: "715045",  # // PLC#2轴加锁故障E13
    1047: "715046",  # // PLC#2轴解锁故障E02
    1048: "715047",  # // PLC#2轴解锁故障E04
    1049: "715048",  # // PLC#2轴解锁故障E01
    1050: "715049",  # // PLC#3轴加锁故障E12
    1051: "715050",  # // PLC#3轴加锁故障E14
    1052: "715051",  # // PLC#3轴加锁故障E11
    1053: "715052",  # // PLC#3轴加锁故障E13
    1054: "715053",  # // PLC#3轴解锁故障E02
    1055: "715054",  # // PLC#3轴解锁故障E04
    1056: "715055",  # // PLC#3轴解锁故障E01
    1057: "715056",  # // PLC#4轴加锁故障E12
    1058: "715057",  # // PLC#4轴加锁故障E14
    1059: "715058",  # // PLC#4轴加锁故障E11
    1060: "715059",  # // PLC#4轴加锁故障E13
    1061: "715060",  # // PLC#4轴解锁故障E02
    1062: "715061",  # // PLC#4轴解锁故障E04
    1063: "715062",  # // PLC#4轴解锁故障E01
    1064: "715063",  # // PLC#5轴加锁故障E12
    1065: "715064",  # // PLC#5轴加锁故障E14
    1066: "715065",  # // PLC#5轴加锁故障E11
    1067: "715066",  # // PLC#5轴加锁故障E13
    1068: "715067",  # // PLC#5轴解锁故障E02
    1069: "715068",  # // PLC#5轴解锁故障E04
    1070: "715069",  # // PLC#5轴解锁故障E01
    1071: "715070",  # // PLC#6轴加锁故障E12
    1072: "715071",  # // PLC#6轴加锁故障E14
    1073: "715072",  # // PLC#6轴加锁故障E11
    1074: "715073",  # // PLC#6轴加锁故障E13
    1075: "715074",  # // PLC#6轴解锁故障E02
    1076: "715075",  # // PLC#6轴解锁故障E04
    1077: "715076",  # // PLC#6轴解锁故障E01
    1078: "715077",  # // PLC#7轴加锁故障E12
    1079: "715078",  # // PLC#7轴加锁故障E14
    1080: "715079",  # // PLC#7轴加锁故障E11
    1081: "715080",  # // PLC#7轴加锁故障E13
    1082: "715081",  # // PLC#7轴解锁故障E02
    1083: "715082",  # // PLC#7轴解锁故障E04
    1084: "715083",  # // PLC#7轴解锁故障E01
    1085: "715084",  # // PLC#8轴加锁故障E12
    1086: "715085",  # // PLC#8轴加锁故障E14
    1087: "715086",  # // PLC#8轴加锁故障E11
    1088: "715087",  # // PLC#8轴加锁故障E13
    1089: "715088",  # // PLC#8轴解锁故障E02
    1090: "715089",  # // PLC#8轴解锁故障E04
    1091: "715090",  # // PLC#8轴解锁故障E01
    1092: "715091",  # // PLC#9轴加锁故障E12
    1093: "715092",  # // PLC#9轴加锁故障E14
    1094: "715093",  # // PLC#9轴加锁故障E11
    1095: "715094",  # // PLC#9轴加锁故障E13
    1096: "715095",  # // PLC#9轴解锁故障E02
    1097: "715096",  # // PLC#9轴解锁故障E04
    1098: "715097",  # // PLC#9轴解锁故障E01
    1099: "715098",  # // PLC#10轴加锁故障E12
    1100: "715099",  # // PLC#10轴加锁故障E14
    1101: "715100",  # // PLC#10轴加锁故障E11
    1102: "715101",  # // PLC#10轴加锁故障E13
    1103: "715102",  # // PLC#10轴解锁故障E02
    1104: "715103",  # // PLC#10轴解锁故障E04
    1105: "715104",  # // PLC#10轴解锁故障E01
    1106: "715105",  # // PLC#1'轴加锁故障E12
    1107: "715106",  # // PLC#1'轴加锁故障E14
    1108: "715107",  # // PLC#1'轴加锁故障E11
    1109: "715108",  # // PLC#1'轴加锁故障E13
    1110: "715109",  # // PLC#1'轴解锁故障E02
    1111: "715110",  # // PLC#1'轴解锁故障E04
    1112: "715111",  # // PLC#1'轴解锁故障E01
    1113: "715112",  # // PLC#2'轴加锁故障E12
    1114: "715113",  # // PLC#2'轴加锁故障E14
    1115: "715114",  # // PLC#2'轴加锁故障E11
    1116: "715115",  # // PLC#2'轴加锁故障E13
    1117: "715116",  # // PLC#2'轴解锁故障E02
    1118: "715117",  # // PLC#2'轴解锁故障E04
    1119: "715118",  # // PLC#2'轴解锁故障E01
    1120: "715119",  # // PLC左前推杆软限位故障
    1121: "715120",  # // PLC右前推杆软限位故障
    1122: "715121",  # // PLC左后推杆软限位故障
    1123: "715122",  # // PLC右后推杆软限位故障
    1124: "715123",  # // PLCV型槽软限位故障
    1125: "715124",  # // PLC#1号枪头升降软限位故障
    1126: "715125",  # // PLC#2号枪头升降软限位故障
    1127: "715126",  # // PLC#1’号枪头升降软限位故障
    1128: "715127",  # // PLC#2’号枪头升降软限位故障
    1129: "715128",  # // PLC#9号枪头平移软限位故障
    1130: "715129",  # // PLC#10号枪头平移软限位故障
    1131: "715130",  # // PLC#9号枪头升降软限位故障
    1132: "715131",  # // PLC#10号枪头升降软限位故障
    1133: "715132",  # // PLC左前车身定位销软限位故障
    1134: "715133",  # // PLC右后车身定位销软限位故障
    1135: "715134",  # // PLC左后车身定位销软限位故障
    1136: "715135",  # // PLC左开合门软限位故障
    1137: "715136",  # // PLC右开合门软限位故障
    1138: "715137",  # // PLC加解锁平台升降软限位故障
    1139: "715138",  # // PLC加解锁平台平移软限位故障
    1140: "715139",  # // PLC前导向条软限位故障
    1141: "715140",  # // PLC后导向条软限位故障
    1142: "715141",  # // PLC接驳位软限位故障
    1143: "715142",  # // PLC货叉软限位故障
    1144: "715143",  # // PLC堆垛机平移软限位故障
    1145: "715144",  # // PLC堆垛机升降软限位故障
    1146: "715145",  # // PLC#1号枪头伺服故障
    1147: "715146",  # // PLC#2号枪头伺服故障
    1148: "715147",  # // PLC#3号枪头伺服故障
    1149: "715148",  # // PLC#4号枪头伺服故障
    1150: "715149",  # // PLC#5号枪头伺服故障
    1151: "715150",  # // PLC#6号枪头伺服故障
    1152: "715151",  # // PLC#7号枪头伺服故障
    1153: "715152",  # // PLC#8号枪头伺服故障
    1154: "715153",  # // PLC#9号枪头伺服故障
    1155: "715154",  # // PLC#10号枪头伺服故障
    1156: "715155",  # // PLC#1’号枪头伺服故障
    1157: "715156",  # // PLC#2’号枪头伺服故障
    1158: "715157",  # // PLC左前推杆伺服故障
    1159: "715158",  # // PLC右前推杆伺服故障
    1160: "715159",  # // PLC左后推杆伺服故障
    1161: "715160",  # // PLC右后推杆伺服故障
    1162: "715161",  # // PLCV型槽伺服故障
    1163: "715162",  # // PLC#1号枪头升降伺服故障
    1164: "715163",  # // PLC#2号枪头升降伺服故障
    1165: "715164",  # // PLC#1’号枪头升降伺服故障
    1166: "715165",  # // PLC#2’号枪头升降伺服故障
    1167: "715166",  # // PLC#9号枪头平移伺服故障
    1168: "715167",  # // PLC#10号枪头平移伺服故障
    1169: "715168",  # // PLC#9号枪头升降伺服故障
    1170: "715169",  # // PLC#10号枪头升降伺服故障
    1171: "715170",  # // PLC左前车身定位销伺服故障
    1172: "715171",  # // PLC右后车身定位销伺服故障
    1173: "715172",  # // PLC左后车身定位销伺服故障
    1174: "715173",  # // PLC左开合门伺服故障
    1175: "715174",  # // PLC右开合门伺服故障
    1176: "715175",  # // PLC加解锁平台升降伺服故障
    1177: "715176",  # // PLC加解锁平台平移伺服故障
    1178: "715177",  # // PLC前导向条伺服故障
    1179: "715178",  # // PLC后导向条伺服故障
    1180: "715179",  # // PLC接驳位伺服故障
    1181: "715180",  # // PLC货叉伺服故障
    1182: "715181",  # // PLC堆垛机平移伺服故障
    1183: "715182",  # // PLC堆垛机升降伺服故障
    1184: "715183",  # // PLC接驳位变频器故障
    1185: "715184",  # // PLC右缓存位变频器故障
    1186: "715185",  # // PLC停车平台变频器故障
    1187: "715186",  # // PLC左缓存位变频器故障
    1188: "715187",  # // PLC加解锁平台升降上硬限位故障
    1189: "715188",  # // PLC加解锁平台升降下硬限位故障
    1190: "715189",  # // PLC加解锁平台平移前硬限位故障
    1191: "715190",  # // PLC加解锁平台平移后硬限位故障
    1192: "715191",  # // PLC停车平台前车辆举升上硬限位故障
    1193: "715192",  # // PLC停车平台前车辆举升下硬限位故障
    1194: "715193",  # // PLC停车平台后车辆举升上硬限位故障
    1195: "715194",  # // PLC停车平台后车辆举升下硬限位故障
    1196: "715195",  # // PLC接驳位上硬限位故障
    1197: "715196",  # // PLC接驳位下硬限位故障
    1198: "715197",  # // PLC货叉前硬限位故障
    1199: "715198",  # // PLC货叉后硬限位故障
    1200: "715199",  # // PLC堆垛机平移前硬限位故障
    1201: "715200",  # // PLC堆垛机平移后硬限位故障
    1202: "715201",  # // PLC堆垛机升降上硬限位故障
    1203: "715202",  # // PLC堆垛机升降下硬限位故障
    1204: "715203",  # // PLC#1号枪头伺服未使能
    1205: "715204",  # // PLC#2号枪头伺服未使能
    1206: "715205",  # // PLC#3号枪头伺服未使能
    1207: "715206",  # // PLC#4号枪头伺服未使能
    1208: "715207",  # // PLC#5号枪头伺服未使能
    1209: "715208",  # // PLC#6号枪头伺服未使能
    1210: "715209",  # // PLC#7号枪头伺服未使能
    1211: "715210",  # // PLC#8号枪头伺服未使能
    1212: "715211",  # // PLC#9号枪头伺服未使能
    1213: "715212",  # // PLC#10号枪头伺服未使能
    1214: "715213",  # // PLC#1’号枪头伺服未使能
    1215: "715214",  # // PLC#2’号枪头伺服未使能
    1216: "715215",  # // PLC左前推杆伺服未使能
    1217: "715216",  # // PLC右前推杆伺服未使能
    1218: "715217",  # // PLC左后推杆伺服未使能
    1219: "715218",  # // PLC右后推杆伺服未使能
    1220: "715219",  # // PLCV型槽伺服未使能
    1221: "715220",  # // PLC#1号枪头升降伺服未使能
    1222: "715221",  # // PLC#2号枪头升降伺服未使能
    1223: "715222",  # // PLC#1’号枪头升降伺服未使能
    1224: "715223",  # // PLC#2’号枪头升降伺服未使能
    1225: "715224",  # // PLC#9号枪头平移伺服未使能
    1226: "715225",  # // PLC#10号枪头平移伺服未使能
    1227: "715226",  # // PLC#9号枪头升降伺服未使能
    1228: "715227",  # // PLC#10号枪头升降伺服未使能
    1229: "715228",  # // PLC左前车身定位销伺服未使能
    1230: "715229",  # // PLC右后车身定位销伺服未使能
    1231: "715230",  # // PLC左后车身定位销伺服未使能
    1232: "715231",  # // PLC左开合门伺服未使能
    1233: "715232",  # // PLC右开合门伺服未使能
    1234: "715233",  # // PLC加解锁平台升降伺服未使能
    1235: "715234",  # // PLC加解锁平台平移伺服未使能
    1236: "715235",  # // PLC前导向条伺服未使能
    1237: "715236",  # // PLC后导向条伺服未使能
    1238: "715237",  # // PLC接驳位伺服未使能
    1239: "715238",  # // PLC货叉伺服未使能
    1240: "715239",  # // PLC堆垛机平移伺服未使能
    1241: "715240",  # // PLC堆垛机升降伺服未使能
    1242: "715241",  # // PLC扩展箱控制供电脱扣报警
    1243: "715242",  # // PLC扩展箱动力供电脱扣报警
    1244: "715243",  # // PLC堆垛机货叉伺服供电脱扣报警
    1245: "715244",  # // PLC堆垛机行走伺服供电脱扣报警
    1246: "715245",  # // PLC堆垛机升降伺服供电脱扣报警
    1247: "715246",  # // PLC刹车开关电源后端配电脱扣报警
    1248: "715247",  # // PLC前轮推杆伺服供电脱扣报警
    1249: "715248",  # // PLC后轮推杆伺服供电脱扣报警
    1250: "715249",  # // PLCV槽&导向条伺服供电脱扣报警
    1251: "715250",  # // PLC车身定位销伺服供电脱扣报警
    1252: "715251",  # // PLC拧紧枪1 伺服供电脱扣报警
    1253: "715252",  # // PLC拧紧枪2 伺服供电脱扣报警
    1254: "715253",  # // PLC拧紧枪3&4 伺服供电脱扣报警
    1255: "715254",  # // PLC拧紧枪5&6 伺服供电脱扣报警
    1256: "715255",  # // PLC拧紧枪7&8 伺服供电脱扣报警
    1257: "715256",  # // PLC拧紧枪9 伺服供电脱扣报警
    1258: "715257",  # // PLC拧紧枪10 伺服供电脱扣报警
    1259: "715258",  # // PLC拧紧枪11 伺服供电脱扣报警
    1260: "715259",  # // PLC拧紧枪12 伺服供电脱扣报警
    1261: "715260",  # // PLC开合门伺服供电脱扣报警
    1262: "715261",  # // PLCRGV伺服供电脱扣报警
    1263: "715262",  # // PLC车辆举升伺服供电脱扣报警
    1264: "715263",  # // PLC接驳位举升伺服供电脱扣报警
    1265: "715264",  # // PLC变频器供电脱扣报警
    1266: "715265",  # // PLC初始时工位参数读取错误
    1267: "715266",  # // PLC与#1号枪头伺服通讯断开
    1268: "715267",  # // PLC与#2号枪头伺服通讯断开
    1269: "715268",  # // PLC与#3号枪头伺服通讯断开
    1270: "715269",  # // PLC与#4号枪头伺服通讯断开
    1271: "715270",  # // PLC与#5号枪头伺服通讯断开
    1272: "715271",  # // PLC与#6号枪头伺服通讯断开
    1273: "715272",  # // PLC与#7号枪头伺服通讯断开
    1274: "715273",  # // PLC与#8号枪头伺服通讯断开
    1275: "715274",  # // PLC与#9号枪头伺服通讯断开
    1276: "715275",  # // PLC与#10号枪头伺服通讯断开
    1277: "715276",  # // PLC与#1’号枪头伺服通讯断开
    1278: "715277",  # // PLC与#2’号枪头伺服通讯断开
    1279: "715278",  # // PLC与左前推杆伺服通讯断开
    1280: "715279",  # // PLC与右前推杆伺服通讯断开
    1281: "715280",  # // PLC与左后推杆伺服通讯断开
    1282: "715281",  # // PLC与右后推杆伺服通讯断开
    1283: "715282",  # // PLC与V型槽伺服通讯断开
    1284: "715283",  # // PLC与#1号枪头升降伺服通讯断开
    1285: "715284",  # // PLC与#2号枪头升降伺服通讯断开
    1286: "715285",  # // PLC与#1’号枪头升降伺服通讯断开
    1287: "715286",  # // PLC与#2’号枪头升降伺服通讯断开
    1288: "715287",  # // PLC与#9号枪头平移伺服通讯断开
    1289: "715288",  # // PLC与#10号枪头平移伺服通讯断开
    1290: "715289",  # // PLC与#9号枪头升降伺服通讯断开
    1291: "715290",  # // PLC与#10号枪头升降伺服通讯断开
    1292: "715291",  # // PLC与左前车身定位销伺服通讯断开
    1293: "715292",  # // PLC与右后车身定位销伺服通讯断开
    1294: "715293",  # // PLC与左后车身定位销伺服通讯断开
    1295: "715294",  # // PLC与左开合门伺服通讯断开
    1296: "715295",  # // PLC与右开合门伺服通讯断开
    1297: "715296",  # // PLC与加解锁平台升降伺服通讯断开
    1298: "715297",  # // PLC与加解锁平台平移伺服通讯断开
    1299: "715298",  # // PLC与前导向条伺服通讯断开
    1300: "715299",  # // PLC与后导向条伺服通讯断开
    1301: "715300",  # // PLC与接驳位伺服通讯断开
    1302: "715301",  # // PLC与货叉伺服通讯断开
    1303: "715302",  # // PLC与堆垛机平移伺服通讯断开
    1304: "715303",  # // PLC与堆垛机升降伺服通讯断开
    1305: "715304",  # // PLC与I/O模块通讯断开
    1306: "715305",  # // PLC与变频器通讯断开
    1307: "715306",  # // PLC#1号枪头伺服参数设置错误，请核查；
    1308: "715307",  # // PLC#2号枪头伺服参数设置错误，请核查；
    1309: "715308",  # // PLC#3号枪头伺服参数设置错误，请核查；
    1310: "715309",  # // PLC#4号枪头伺服参数设置错误，请核查；
    1311: "715310",  # // PLC#5号枪头伺服参数设置错误，请核查；
    1312: "715311",  # // PLC#6号枪头伺服参数设置错误，请核查；
    1313: "715312",  # // PLC#7号枪头伺服参数设置错误，请核查；
    1314: "715313",  # // PLC#8号枪头伺服参数设置错误，请核查；
    1315: "715314",  # // PLC#9号枪头伺服参数设置错误，请核查；
    1316: "715315",  # // PLC#10号枪头伺服参数设置错误，请核查；
    1317: "715316",  # // PLC#1’号枪头伺服参数设置错误，请核查；
    1318: "715317",  # // PLC#2’号枪头伺服参数设置错误，请核查；
    1319: "715318",  # // PLC左前推杆伺服参数设置错误，请核查；
    1320: "715319",  # // PLC右前推杆伺服参数设置错误，请核查；
    1321: "715320",  # // PLC左后推杆伺服参数设置错误，请核查；
    1322: "715321",  # // PLC右后推杆伺服参数设置错误，请核查；
    1323: "715322",  # // PLCV型槽伺服参数设置错误，请核查；
    1324: "715323",  # // PLC#1号枪头升降伺服参数设置错误，请核查；
    1325: "715324",  # // PLC#2号枪头升降伺服参数设置错误，请核查；
    1326: "715325",  # // PLC#1’号枪头升降伺服参数设置错误，请核查；
    1327: "715326",  # // PLC#2’号枪头升降伺服参数设置错误，请核查；
    1328: "715327",  # // PLC#9号枪头平移伺服参数设置错误，请核查；
    1329: "715328",  # // PLC#10号枪头平移伺服参数设置错误，请核查；
    1330: "715329",  # // PLC#9号枪头升降伺服参数设置错误，请核查；
    1331: "715330",  # // PLC#10号枪头升降伺服参数设置错误，请核查；
    1332: "715331",  # // PLC左前车身定位销伺服参数设置错误，请核查；
    1333: "715332",  # // PLC右后车身定位销伺服参数设置错误，请核查；
    1334: "715333",  # // PLC左后车身定位销伺服参数设置错误，请核查；
    1335: "715334",  # // PLC左开合门伺服参数设置错误，请核查；
    1336: "715335",  # // PLC右开合门伺服参数设置错误，请核查；
    1337: "715336",  # // PLC加解锁平台升降伺服参数设置错误，请核查；
    1338: "715337",  # // PLC加解锁平台平移伺服参数设置错误，请核查；
    1339: "715338",  # // PLC前导向条伺服参数设置错误，请核查；
    1340: "715339",  # // PLC后导向条伺服参数设置错误，请核查；
    1341: "715340",  # // PLC接驳位伺服参数设置错误，请核查；
    1342: "715341",  # // PLC货叉移动伺服参数设置错误，请核查；
    1343: "715342",  # // PLC堆垛机平移伺服参数设置错误，请核查；
    1344: "715343",  # // PLC堆垛机升降伺服参数设置错误，请核查；
    1345: "715344",  # // PLC系统初始化时货叉上有电池
    1346: "715345",  # // PLC系统初始化时货叉未缩回
    1347: "715346",  # // PLC系统初始化时接驳位上电池前到位传感器触发
    1348: "715347",  # // PLC系统初始化时接驳位上电池后到位传感器触发
    1349: "715348",  # // PLC系统初始化时加解锁平台上电池前到位传感器触发
    1350: "715349",  # // PLC系统初始化时加解锁平台上电池后到位传感器触发
    1351: "715350",  # // PLC系统初始化时加解锁平台上电池减速传感器触发
    1352: "715351",  # // PLC系统初始化时加解锁平台上电池左缓存位安全传感器触发
    1353: "715352",  # // PLC系统初始化时加解锁平台上电池右缓存位安全传感器触发
    1354: "715353",  # // PLC系统初始化时加解锁平台升降未在零点位
    1355: "715354",  # // PLC系统初始化时加解锁平台平移未在零点位
    1356: "715355",  # // PLC系统初始化时左缓存位电池前到位传感器触发
    1357: "715356",  # // PLC系统初始化时左缓存位电池后到位传感器触发
    1358: "715357",  # // PLC系统初始化时左前推杆未在零点位
    1359: "715358",  # // PLC系统初始化时右前推杆未在零点位
    1360: "715359",  # // PLC系统初始化时左后推杆未在零点位
    1361: "715360",  # // PLC系统初始化时右后推杆未在零点位
    1362: "715361",  # // PLC系统初始化时左开合门未关闭
    1363: "715362",  # // PLC系统初始化时右开合门未关闭
    1364: "715363",  # // PLC-DI_01模块报错
    1365: "715364",  # // PLC-DI_02模块报错
    1366: "715365",  # // PLC-DI_03模块报错
    1367: "715366",  # // PLC-DI_04模块报错
    1368: "715367",  # // PLC-DI_05模块报错
    1369: "715368",  # // PLC-DI_06模块报错
    1370: "715369",  # // PLC-DI_07模块报错
    1371: "715370",  # // PLC-DI_08模块报错
    1372: "715371",  # // PLC-DI_09模块报错
    1373: "715372",  # // PLC-DI_10模块报错
    1374: "715373",  # // PLC-DI_11模块报错
    1375: "715374",  # // PLC-DI_12模块报错
    1376: "715375",  # // PLC-DI_13模块报错
    1377: "715376",  # // PLC-DI_14模块报错
    1378: "715377",  # // PLC-DI_15模块报错
    1379: "715378",  # // PLC-DI_16模块报错
    1380: "715379",  # // PLC右缓存位前挡块缩回超时
    1381: "715380",  # // PLC右缓存位前挡块伸出超时
    1382: "715381",  # // PLC右缓存位前挡块伸出时前电池到位传感器触发
    1383: "715382",  # // PLC右缓存位前挡块伸出时后电池到位传感器触发
    1384: "715383",  # // PLC右缓存位前挡块伸出时缓存位电池安全传感器触发
    1385: "715384",  # // PLC右缓存位后挡块缩回超时
    1386: "715385",  # // PLC右缓存位后挡块伸出超时
    1387: "715386",  # // PLC右缓存位后挡块伸出时前电池到位传感器触发
    1388: "715387",  # // PLC右缓存位后挡块伸出时后电池到位传感器触发
    1389: "715388",  # // PLC右缓存位后挡块伸出时缓存位电池安全传感器触发
    1390: "715389",  # // PLCC1仓电池类型检测异常
    1391: "715390",  # // PLCC2仓电池类型检测异常
    1392: "715391",  # // PLCC3仓电池类型检测异常
    1393: "715392",  # // PLCC4仓电池类型检测异常
    1394: "715393",  # // PLCC5仓电池类型检测异常
    1395: "715394",  # // PLCC6仓电池类型检测异常
    1396: "715395",  # // PLCC7仓电池类型检测异常
    1397: "715396",  # // PLCC8仓电池类型检测异常
    1398: "715397",  # // PLCC9仓电池类型检测异常
    1399: "715398",  # // PLCC10仓电池类型检测异常
    1400: "715399",  # // PLCA1仓电池类型检测异常
    1401: "715400",  # // PLCA2仓电池类型检测异常
    1402: "715401",  # // PLCA3仓电池类型检测异常
    1403: "715402",  # // PLCA4仓电池类型检测异常
    1404: "715403",  # // PLCA5仓电池类型检测异常
    1405: "715404",  # // PLCA6仓电池类型检测异常
    1406: "715405",  # // PLCA7仓电池类型检测异常
    1407: "715406",  # // PLCA8仓电池类型检测异常
    1408: "715407",  # // PLCA9仓电池类型检测异常
    1409: "715408",  # // PLCA10仓电池类型检测异常
    1410: "715409",  # // PLCA11仓电池类型检测异常
    1411: "715410",  # // PLC加解锁平台电池类型检测异常
    1412: "715411",  # // PLC电池流转至加解锁平台时电池类型与车辆类型不匹配
    1413: "715412",  # // PLCV槽至零点位时左锁止挡块未缩回
    1414: "715413",  # // PLCV槽至零点位时右锁止挡块未缩回
    1415: "715414",  # // PLCV槽至工作位时左锁止挡块未缩回
    1416: "715415",  # // PLCV槽至工作位时右锁止挡块未缩回
    1417: "715416",  # // PLC左锁止缩回时V槽未在零点位或未在工作位
    1418: "715417",  # // PLC左锁止伸出时V槽未在零点位或未在工作位
    1419: "715418",  # // PLC右锁止缩回时V槽未在零点位或未在工作位
    1420: "715419",  # // PLC右锁止伸出时V槽未在零点位或未在工作位
    1421: "715420",  # // PLC左锁止缩回超时
    1422: "715421",  # // PLC左锁止伸出超时
    1423: "715422",  # // PLC右锁止缩回超时
    1424: "715423",  # // PLC右锁止伸出超时
    1425: "715424",  # // PLC系统初始化时接驳位上电池减速传感器触发
    1426: "715425",  # // PLC系统初始化时接驳位上电池安全传感器触发
    1427: "715426",  # // PLC系统初始化时右缓存位电池前到位传感器触发
    1428: "715427",  # // PLC系统初始化时右缓存位电池后到位传感器触发
    1429: "715428",  # // PLC系统初始化时右缓存位电池减速传感器触发
    1430: "715429",  # // PLC货叉上左电池检测传感器一次换电未触发
    1431: "715430",  # // PLC货叉上右电池检测传感器一次换电未触发
    1432: "715431",  # // PLC堆垛机左上电池安全检测传感器一次换电未触发
    1433: "715432",  # // PLC堆垛机左下电池安全检测传感器一次换电未触发
    1434: "715433",  # // PLC堆垛机右上电池安全检测传感器一次换电未触发
    1435: "715434",  # // PLC堆垛机右下电池安全检测传感器一次换电未触发
    1436: "715435",  # // PLC系统初始化时左缓存位电池减速传感器触发
    1437: "715436",  # // PLC系统初始化时1枪升降未在零点位
    1438: "715437",  # // PLC系统初始化时2枪升降未在零点位
    1439: "715438",  # // PLC系统初始化时9枪升降未在零点位
    1440: "715439",  # // PLC系统初始化时10枪升降未在零点位
    1441: "715440",  # // PLC系统初始化时1'枪升降未在零点位
    1442: "715441",  # // PLC系统初始化时2'枪升降未在零点位
    1443: "715442",  # // PLC右开合门打开时接驳位未在零点位
    1444: "715443",  # // PLC接驳位至零点位时右开合门未关闭
    1445: "715444",  # // PLC接驳位至工作位时右开合门未关闭
    1446: "715445",  # // PLC电池从接驳位运转至停车平台超时前到位传感器未触发
    1447: "715446",  # // PLC电池从接驳位运转至停车平台超时后到位传感器未触发
    1448: "715447",  # // PLC电池从接驳位运转至停车平台时加解锁平台升降未在零点位
    1449: "715448",  # // PLC电池从接驳位运转至停车平台时接驳位未在零点位
    1450: "715449",  # // PLC电池从接驳位运转至停车平台时左前车身定位销未缩回
    1451: "715450",  # // PLC电池从接驳位运转至停车平台时右后车身定位销未缩回
    1452: "715451",  # // PLC电池从接驳位运转至停车平台时左后车身定位销未缩回
    1453: "715452",  # // PLC电池从接驳位运转至停车平台时停车平台前导向条未伸出
    1454: "715453",  # // PLC电池从接驳位运转至停车平台时停车平台后导向条未伸出
    1455: "715454",  # // PLC电池从接驳位运转至停车平台时加解锁平台平移未在工作位
    1456: "715455",  # // PLC电池从接驳位运转至停车平台时货叉未缩回
    1457: "715456",  # // PLC电池从接驳位运转至停车平台时右缓存位前挡块未缩回
    1458: "715457",  # // PLC电池从接驳位运转至停车平台时右缓存位后挡块未缩回
    1459: "715458",  # // PLC电池从接驳位运转至停车平台时加解锁平台前挡块未伸出
    1460: "715459",  # // PLC电池从接驳位运转至停车平台时加解锁平台后挡块未伸出
    1461: "715460",  # // PLC接驳位带电池举升时，货叉未缩回到位
    1462: "715461",  # // PLC左前定位销车身接触传感器未触发或左前定位销扭矩过大
    1463: "715462",  # // PLC左后定位销车身接触传感器未触发或左后定位销扭矩过大
    1464: "715463",  # // PLC右后定位销车身接触传感器未触发或右后定位销扭矩过大
    1465: "715464",  # // PLC电池从右缓存位运转至停车平台时加右缓存位前挡块未缩回
    1466: "715465",  # // PLC电池从右缓存位运转至停车平台时加右缓存位后挡块未缩回
    1467: "715466",  # // PLC接驳位带电池举升时接驳位上电池未到位
    1468: "715467",  # // PLC检测到B仓门打开
    1469: "715468",  # // PLC电池转运时液压举升原点传感器未触发
    1470: "715469",  # // PLC系统初始化时液压举升原点传感器未触发
    1471: "715470",  # // PLC加锁前左前车身定位销未进孔
    1472: "715471",  # // PLC加锁前左后车身定位销未进孔
    1473: "715472",  # // PLC加锁前右后车身定位销未进孔
    1474: "715473",  # // PLC前导向条至工作位时达到扭矩阈值
    1475: "715474",  # // PLC前导向条至原点位时达到扭矩阈值
    1476: "715475",  # // PLC后导向条至工作位时达到扭矩阈值
    1477: "715476",  # // PLC后导向条至原点位时达到扭矩阈值
    1478: "715477",  # // PLC左前推杆至工作位时达到扭矩阈值
    1479: "715478",  # // PLC左前推杆至原点位时达到扭矩阈值
    1480: "715479",  # // PLC左后推杆至工作位时达到扭矩阈值
    1481: "715480",  # // PLC左后推杆至原点位时达到扭矩阈值
    1482: "715481",  # // PLC右前推杆至工作位时达到扭矩阈值
    1483: "715482",  # // PLC右前推杆至原点位时达到扭矩阈值
    1484: "715483",  # // PLC右后推杆至工作位时达到扭矩阈值
    1485: "715484",  # // PLC右后推杆至原点位时达到扭矩阈值
    1486: "715485",  # //PLC#1轴单轴加锁故障E14
    1487: "715486",  # //PLC#1轴单轴加锁故障E11
    1488: "715487",  # //PLC#1轴单轴加锁故障E13
    1489: "715488",  # //PLC#2轴单轴加锁故障E14
    1490: "715489",  # //PLC#2轴单轴加锁故障E11
    1491: "715490",  # //PLC#2轴单轴加锁故障E13
    1492: "715491",  # //PLC#3轴单轴加锁故障E14
    1493: "715492",  # //PLC#3轴单轴加锁故障E11
    1494: "715493",  # //PLC#3轴单轴加锁故障E13
    1495: "715494",  # //PLC#4轴单轴加锁故障E14
    1496: "715495",  # //PLC#4轴单轴加锁故障E11
    1497: "715496",  # //PLC#4轴单轴加锁故障E13
    1498: "715497",  # //PLC#5轴单轴加锁故障E14
    1499: "715498",  # //PLC#5轴单轴加锁故障E11
    1500: "715499",  # //PLC#5轴单轴加锁故障E13
    1501: "715500",  # //PLC#6轴单轴加锁故障E14
    1502: "715501",  # //PLC#6轴单轴加锁故障E11
    1503: "715502",  # //PLC#6轴单轴加锁故障E13
    1504: "715503",  # //PLC#7轴单轴加锁故障E14
    1505: "715504",  # //PLC#7轴单轴加锁故障E11
    1506: "715505",  # //PLC#7轴单轴加锁故障E13
    1507: "715506",  # //PLC#8轴单轴加锁故障E14
    1508: "715507",  # //PLC#8轴单轴加锁故障E11
    1509: "715508",  # //PLC#8轴单轴加锁故障E13
    1510: "715509",  # //PLC#9轴单轴加锁故障E14
    1511: "715510",  # //PLC#9轴单轴加锁故障E11
    1512: "715511",  # //PLC#9轴单轴加锁故障E13
    1513: "715512",  # //PLC#10轴单轴加锁故障E14
    1514: "715513",  # //PLC#10轴单轴加锁故障E11
    1515: "715514",  # //PLC#10轴单轴加锁故障E13
    1516: "715515",  # //PLC#1'轴单轴加锁故障E14
    1517: "715516",  # //PLC#1'轴单轴加锁故障E11
    1518: "715517",  # //PLC#1'轴单轴加锁故障E13
    1519: "715518",  # //PLC#2'轴单轴加锁故障E14
    1520: "715519",  # //PLC#2'轴单轴加锁故障E11
    1521: "715520",  # //PLC#2'轴单轴加锁故障E13
    1522: "715521",  # //PLC换电失败执行回退
    1523: "715522",  # //PLC换电回退一键加锁失败
    1524: "715523",  # //PLC平台安全光幕被触发
    1525: "715524",  # //PLC电池从左缓存至接驳位时加解锁平台上有电池
    1526: "715525",  # //PLC一键落水按钮回路异常
}

status_rep_msg = {
    "c_plc_msg_size": {
        'c_msg_size': (13216, None),
    },
    "c_mode": {
        'c_work_mode': (2, None),
    },
    "c_lr": {
        "c_axis": [{
            "c_moving": (False, None),
            "c_stand_still": (False, None),
            "c_syn_mode": (False, None),
            "c_stopping": (False, None),
            "c_fault": (False, None),
            "c_warning": (False, None),
            "c_id": (i + 1, None),
            "c_fault_id": (0, None),
            "c_warning_id": (0, None),  # uint16_t warning_id;
            "c_servo_mode": (0, None),
            "c_torque_actual_value": (0, 604009 + 12 * i),
            "c_pos_actual_value": (0, 604010 + 12 * i),
            "c_velocity_actual_value": (0, 604011 + 12 * i),
        } for i in range(24)] + [{
            "c_moving": (False, None),
            "c_stand_still": (False, 604252),
            "c_syn_mode": (False, 604253),
            "c_stopping": (False, 604254),
            "c_fault": (False, 604255),
            "c_warning": (False, 604256),
            "c_id": (25, 604257),
            "c_fault_id": (0, 604258),
            "c_warning_id": (0, 604259),  # uint16_t warning_id;
            "c_servo_mode": (0, 604260),
            "c_torque_actual_value": (0, 604261),
            "c_pos_actual_value": (0, 604262),
            "c_velocity_actual_value": (0, 604263),
        }],
        "c_battery_exist": (False, None)
    },
    "c_bc": {
        "c_axis": [{
            "c_moving": (False, None),
            "c_stand_still": (False, 604264),
            "c_syn_mode": (False, 604265),
            "c_stopping": (False, 604266),
            "c_fault": (False, 604267),
            "c_warning": (False, 604268),
            "c_id": (i + 26, 604269),
            "c_fault_id": (0, 604270),
            "c_warning_id": (0, 604271),  # uint16_t warning_id;
            "c_servo_mode": (0, 604272),
            "c_torque_actual_value": (0, 604273),
            "c_pos_actual_value": (0, 604274),
            "c_velocity_actual_value": (0, 604275),
        } for i in range(4)],
        "c_battery_exist": [(False, None)] * 24  # BC16 battery_exist17
    },
    "c_vp": {
        "c_axis": [{
            "c_moving": (False, None),
            "c_stand_still": (False, 604144 + i * 12),
            "c_syn_mode": (False, 604145 + i * 12),
            "c_stopping": (False, 604146 + i * 12),
            "c_fault": (False, 604147 + i * 12),
            "c_warning": (False, 604148 + i * 12),
            "c_id": (i + 30, 604149 + i * 12),
            "c_fault_id": (0, 604150 + i * 12),
            "c_warning_id": (0, 604151 + i * 12),  # uint16_t warning_id;
            "c_servo_mode": (0, 604152 + i * 12),
            "c_torque_actual_value": (0, 604153 + i * 12),
            "c_pos_actual_value": (0, 604154 + i * 12),
            "c_velocity_actual_value": (0, 604155 + i * 12),
        } for i in range(9)],
        "c_vehicle_exist": (False, None)
    },
    "c_sensor": {
        "c_roller_door_01_up_limt": (False, None),  # // 前卷帘门上到位
        "c_roller_door_01_down_limt": (False, None),  # // 前卷帘门下到位
        "c_roller_door_02_up_limt": (False, None),  # // 后卷帘门上到位
        "c_roller_door_02_down_limt": (False, None),  # // 后卷帘门下到位
        "c_front_roller_door_safety_01": (False, None),  # // 前卷帘门安全保护1
        "c_front_roller_door_safety_02": (False, None),  # // 前卷帘门安全保护2
        "c_rear_roller_door_safety_01": (False, None),  # // 后卷帘门安全保护1
        "c_rear_roller_door_safety_02": (False, None),  # // 后卷帘门安全保护2
        "c_maintain_area_safety_01": (False, None),  # // 维护区安全保护1
        "c_maintain_area_safety_02": (False, None),  # // 维护区安全保护2
        "c_pl_buffer_dece_sensor_1": (False, None),  # // 左缓存区电池减速
        "c_pl_buffer_sensor_f_1": (False, None),  # // 左缓存区前电池到位
        "c_pl_buffer_sensor_r_1": (False, None),  # // 左缓存区后电池到位
        "c_pl_lf_clamp_home_sensor": (False, None),  # // 左前轮推杆原点
        "c_pl_lf_V_check_sensor": (False, None),  # // 左前轮进槽
        "c_pl_l_V_lock_extend_sensor": (False, None),  # // V槽左锁止上到位
        "c_pl_l_V_lock_retract_sensor": (False, None),  # // V槽左锁止下到位
        "c_pl_rf_clamp_home_sensor": (False, None),  # // 右前轮推杆原点
        "c_pl_rf_V_check_sensor": (False, None),  # // 右前轮进槽
        "c_pl_r_V_lock_extend_sensor": (False, None),  # // V槽右锁止上到位
        "c_pl_r_V_lock_retract_sensor": (False, None),  # // V槽右锁止下到位
        "c_pl_f_guide_work_sensor": (False, None),  # // 前导向条前到位
        "c_pl_f_guide_home_sensor": (False, None),  # // 前导向条后到位
        "c_pl_r_guide_work_sensor": (False, None),  # // 后导向条前到位
        "c_pl_r_guide_home_sensor": (False, None),  # // 后导向条后到位
        "c_pl_lr_clamp_home_sensor": (False, None),  # // 左后轮推杆原点
        "c_pl_rr_clamp_home_sensor": (False, None),  # // 右后轮推杆原点
        "c_pl_door_01_open_sensor": (False, None),  # // 左开合门开到位
        "c_pl_door_01_close_sensor": (False, None),  # // 左开合门关到位
        "c_pl_door_02_open_sensor": (False, None),  # // 右开合门开到位
        "c_pl_door_02_close_sensor": (False, None),  # // 右开合门关到位
        "c_pl_door_close_safe_sensor": (False, None),  # // 开合门闭合安全
        "c_bc_lift_dece_sensor": (False, None),  # // 接驳位减速
        "c_bc_lift_reach_sensor_f": (False, None),  # // 接驳位前到位
        "c_bc_lift_reach_sensor_r": (False, None),  # // 接驳位后到位
        "c_bc_lift_work_sensor": (False, None),  # // 接驳位举升工作位
        "c_pl_buffer_dece_sensor_2": (False, None),  # // 右缓存区电池减速
        "c_pl_buffer_sensor_f_2": (False, None),  # // 右缓存区前电池到位
        "c_pl_buffer_sensor_r_2": (False, None),  # // 右缓存区后电池到位
        "c_buffer_stopper_01_extend_sensor_02": (False, None),  # // 右缓存区前电池阻挡工作位
        "c_buffer_stopper_01_retract_sensor_02": (False, None),  # // 右缓存区前电池阻挡原点位
        "c_buffer_stopper_02_extend_sensor_02": (False, None),  # // 右缓存区后电池阻挡工作位
        "c_buffer_stopper_02_retract_sensor_02": (False, None),  # // 右缓存区后电池阻挡原点位
        "c_RGV_bc_reach_sensor_01": (False, None),  # // 电池平整1
        "c_RGV_bc_reach_sensor_02": (False, None),  # // 电池平整2
        "c_RGV_bc_reach_sensor_03": (False, None),  # // 电池平整3
        "c_RGV_bc_reach_sensor_04": (False, None),  # // 电池平整4
        "c_RGV_bc_reach_sensor_05": (False, None),  # // 电池平整5
        "c_RGV_bc_reach_sensor_06": (False, None),  # // 电池平整6
        "c_lf_pin_extend_sensor": (False, None),  # // 左前车身定位销上到位
        "c_lf_pin_retract_sensor": (False, None),  # // 左前车身定位销下到位
        "c_lf_pin_touch_sensor": (False, None),  # // 左前车身定位销接触车身
        "c_rr_pin_extend_sensor": (False, None),  # // 右后车身定位销上到位
        "c_rr_pin_retract_sensor": (False, None),  # // 右后车身定位销下到位
        "c_rr_pin_touch_sensor": (False, None),  # // 右后车身定位销接触车身
        "c_lr_pin_extend_sensor": (False, None),  # // 左后车身定位销上到位
        "c_lr_pin_retract_sensor": (False, None),  # // 左后车身定位销下到位
        "c_lr_pin_touch_sensor": (False, None),  # // 左后车身定位销接触车身
        "c_gun1_lift_work_sensor": (False, None),  # // 1#升降上到位
        "c_gun1_lift_home_sensor": (False, None),  # // 1#升降下到位
        "c_gun2_lift_work_sensor": (False, None),  # // 2#升降上到位
        "c_gun2_lift_home_sensor": (False, None),  # // 2#升降下到位
        "c_gun9_move_home_sensor": (False, None),  # // 9#平移位置1
        "c_gun9_move_work_sensor": (False, None),  # // 9#平移位置2
        "c_gun9_lift_work_sensor": (False, None),  # // 9#升降上到位
        "c_gun9_lift_home_sensor": (False, None),  # // 9#升降下到位
        "c_gun10_move_home_sensor": (False, None),  # // 10#平移位置1
        "c_gun10_move_work_sensor": (False, None),  # // 10#平移位置2
        "c_gun10_lift_work_sensor": (False, None),  # // 10#升降上到位
        "c_gun10_lift_home_sensor": (False, None),  # // 10#升降下到位
        "c_gun11_lift_work_sensor": (False, None),  # // 11#升降上到位
        "c_gun11_lift_home_sensor": (False, None),  # // 11#升降下到位
        "c_gun12_lift_work_sensor": (False, None),  # // 12#升降上到位
        "c_gun12_lift_home_sensor": (False, None),  # // 12#升降下到位
        "c_RGV_work_sensor": (False, None),  # // RGV举升工作位
        "c_RGV_maintain_sensor": (False, None),  # // RGV举升维护位
        "c_pl_stopper_01_home_sensor": (False, None),  # // 前电池阻挡升降原点位
        "c_pl_stopper_01_work_sensor": (False, None),  # // 前电池阻挡升降工作位
        "c_pl_stopper_01_reach_sensor": (False, None),  # // 前电池阻挡电池到位
        "c_pl_stopper_02_home_sensor": (False, None),  # // 后电池阻挡升降原点位
        "c_pl_stopper_02_work_sensor": (False, None),  # // 后电池阻挡升降工作位
        "c_pl_stopper_02_reach_sensor": (False, None),  # // 后电池阻挡电池到位
        "c_pl_move_work_sensor_1": (False, None),  # // RGV平移 传送位
        "c_pl_move_work_sensor_2": (False, None),  # // RGV平移 NPA位
        "c_pl_move_work_sensor_3": (False, None),  # // RGV平移 NPD位
        "c_pl_move_work_sensor_4": (False, None),  # // RGV平移备用1
        "c_pl_move_work_sensor_5": (False, None),  # // RGV平移备用2
        "c_pl_stopper_01_dece_sensor": (False, None),  # // 前电池阻挡电池减速

        "c_bc_slot1_ec_retract_sensor_1": (False, None),  # // 1仓NPA电插头上到位
        "c_bc_slot1_ec_extend_sensor_1": (False, None),  # // 1仓NPA电插头下到位
        "c_bc_slot1_lc_retract_sensor_1": (False, None),  # // 1仓NPA水插头上到位
        "c_bc_slot1_lc_extend_sensor_1": (False, None),  # // 1仓NPA水插头下到位
        "c_bc_slot1_ec_retract_sensor_2": (False, None),  # // 1仓NPD电插头上到位
        "c_bc_slot1_ec_extend_sensor_2": (False, None),  # // 1仓NPD电插头下到位
        "c_bc_slot1_lc_retract_sensor_2": (False, None),  # // 1仓NPD水插头上到位
        "c_bc_slot1_lc_extend_sensor_2": (False, None),  # // 1仓NPD水插头下到位
        "c_bc_slot1_check_sensor_1": (False, None),  # // 1仓电池区分NPA
        "c_bc_slot1_check_sensor_2": (False, None),  # // 1仓电池区分NPD
        "c_bc_slot1_reached_sensor": (False, None),  # // 1仓电池落到位
        "c_bc_slot1_smoke_sensor": (False, None),  # // 1仓烟雾报警
        "c_bc_slot1_liq_flow_switch_st": (False, None),  # // 1仓水冷流量开关
        "c_bc_sum_smoke_sensor": (False, None),  # // 电池仓整体烟雾
        "c_bc_slot2_ec_retract_sensor_1": (False, None),  # // 2仓NPA电插头上到位
        "c_bc_slot2_ec_extend_sensor_1": (False, None),  # // 2仓NPA电插头下到位
        "c_bc_slot2_lc_retract_sensor_1": (False, None),  # // 2仓NPA水插头上到位
        "c_bc_slot2_lc_extend_sensor_1": (False, None),  # // 2仓NPA水插头下到位
        "c_bc_slot2_ec_retract_sensor_2": (False, None),  # // 2仓NPD电插头上到位
        "c_bc_slot2_ec_extend_sensor_2": (False, None),  # // 2仓NPD电插头下到位
        "c_bc_slot2_lc_retract_sensor_2": (False, None),  # // 2仓NPD水插头上到位
        "c_bc_slot2_lc_extend_sensor_2": (False, None),  # // 2仓NPD水插头下到位
        "c_bc_slot2_check_sensor_1": (False, None),  # // 2仓电池区分NPA
        "c_bc_slot2_check_sensor_2": (False, None),  # // 2仓电池区分NPD
        "c_bc_slot2_reached_sensor": (False, None),  # // 2仓电池落到位
        "c_bc_slot2_smoke_sensor": (False, None),  # // 2仓烟雾报警
        "c_bc_slot2_liq_flow_switch_st": (False, None),  # // 2仓水冷流量开关
        "c_bc_slot3_ec_retract_sensor_1": (False, None),  # // 3仓NPA电插头上到位
        "c_bc_slot3_ec_extend_sensor_1": (False, None),  # // 3仓NPA电插头下到位
        "c_bc_slot3_lc_retract_sensor_1": (False, None),  # // 3仓NPA水插头上到位
        "c_bc_slot3_lc_extend_sensor_1": (False, None),  # // 3仓NPA水插头下到位
        "c_bc_slot3_ec_retract_sensor_2": (False, None),  # // 3仓NPD电插头上到位
        "c_bc_slot3_ec_extend_sensor_2": (False, None),  # // 3仓NPD电插头下到位
        "c_bc_slot3_lc_retract_sensor_2": (False, None),  # // 3仓NPD水插头上到位
        "c_bc_slot3_lc_extend_sensor_2": (False, None),  # // 3仓NPD水插头下到位
        "c_bc_slot3_check_sensor_1": (False, None),  # // 3仓电池区分NPA
        "c_bc_slot3_check_sensor_2": (False, None),  # // 3仓电池区分NPD
        "c_bc_slot3_reached_sensor": (False, None),  # // 3仓电池落到位
        "c_bc_slot3_smoke_sensor": (False, None),  # // 3仓烟雾报警
        "c_bc_slot3_liq_flow_switch_st": (False, None),  # // 3仓水冷流量开关
        "c_bc_slot4_ec_retract_sensor_1": (False, None),  # // 4仓NPA电插头上到位
        "c_bc_slot4_ec_extend_sensor_1": (False, None),  # // 4仓NPA电插头下到位
        "c_bc_slot4_lc_retract_sensor_1": (False, None),  # // 4仓NPA水插头上到位
        "c_bc_slot4_lc_extend_sensor_1": (False, None),  # // 4仓NPA水插头下到位
        "c_bc_slot4_ec_retract_sensor_2": (False, None),  # // 4仓NPD电插头上到位
        "c_bc_slot4_ec_extend_sensor_2": (False, None),  # // 4仓NPD电插头下到位
        "c_bc_slot4_lc_retract_sensor_2": (False, None),  # // 4仓NPD水插头上到位
        "c_bc_slot4_lc_extend_sensor_2": (False, None),  # // 4仓NPD水插头下到位
        "c_bc_slot4_check_sensor_1": (False, None),  # // 4仓电池区分NPA
        "c_bc_slot4_check_sensor_2": (False, None),  # // 4仓电池区分NPD
        "c_bc_slot4_reached_sensor": (False, None),  # // 4仓电池落到位
        "c_bc_slot4_smoke_sensor": (False, None),  # // 4仓烟雾报警
        "c_bc_slot4_liq_flow_switch_st": (False, None),  # // 4仓水冷流量开关
        "c_bc_slot5_ec_retract_sensor_1": (False, None),  # // 5仓NPA电插头上到位
        "c_bc_slot5_ec_extend_sensor_1": (False, None),  # // 5仓NPA电插头下到位
        "c_bc_slot5_lc_retract_sensor_1": (False, None),  # // 5仓NPA水插头上到位
        "c_bc_slot5_lc_extend_sensor_1": (False, None),  # // 5仓NPA水插头下到位
        "c_bc_slot5_ec_retract_sensor_2": (False, None),  # // 5仓NPD电插头上到位
        "c_bc_slot5_ec_extend_sensor_2": (False, None),  # // 5仓NPD电插头下到位
        "c_bc_slot5_lc_retract_sensor_2": (False, None),  # // 5仓NPD水插头上到位
        "c_bc_slot5_lc_extend_sensor_2": (False, None),  # // 5仓NPD水插头下到位
        "c_bc_slot5_check_sensor_1": (False, None),  # // 5仓电池区分NPA
        "c_bc_slot5_check_sensor_2": (False, None),  # // 5仓电池区分NPD
        "c_bc_slot5_reached_sensor": (False, None),  # // 5仓电池落到位
        "c_bc_slot5_smoke_sensor": (False, None),  # // 5仓烟雾报警
        "c_bc_slot5_liq_flow_switch_st": (False, None),  # // 5仓水冷流量开关
        "c_bc_slot1_5_pressure_switch_st": (False, None),  # // 1~5仓水冷压力开关
        "c_bc_slot6_ec_retract_sensor_1": (False, None),  # // 6仓NPA电插头上到位
        "c_bc_slot6_ec_extend_sensor_1": (False, None),  # // 6仓NPA电插头下到位
        "c_bc_slot6_lc_retract_sensor_1": (False, None),  # // 6仓NPA水插头上到位
        "c_bc_slot6_lc_extend_sensor_1": (False, None),  # // 6仓NPA水插头下到位
        "c_bc_slot6_ec_retract_sensor_2": (False, None),  # // 6仓NPD电插头上到位
        "c_bc_slot6_ec_extend_sensor_2": (False, None),  # // 6仓NPD电插头下到位
        "c_bc_slot6_lc_retract_sensor_2": (False, None),  # // 6仓NPD水插头上到位
        "c_bc_slot6_lc_extend_sensor_2": (False, None),  # // 6仓NPD水插头下到位
        "c_bc_slot6_check_sensor_1": (False, None),  # // 6仓电池区分NPA
        "c_bc_slot6_check_sensor_2": (False, None),  # // 6仓电池区分NPD
        "c_bc_slot6_reached_sensor": (False, None),  # // 6仓电池落到位
        "c_bc_slot6_smoke_sensor": (False, None),  # // 6仓烟雾报警
        "c_bc_slot6_liq_flow_switch_st": (False, None),  # // 6仓水冷流量开关
        "c_bc_slot7_ec_retract_sensor_1": (False, None),  # // 7仓NPA电插头上到位
        "c_bc_slot7_ec_extend_sensor_1": (False, None),  # // 7仓NPA电插头下到位
        "c_bc_slot7_lc_retract_sensor_1": (False, None),  # // 7仓NPA水插头上到位
        "c_bc_slot7_lc_extend_sensor_1": (False, None),  # // 7仓NPA水插头下到位
        "c_bc_slot7_ec_retract_sensor_2": (False, None),  # // 7仓NPD电插头上到位
        "c_bc_slot7_ec_extend_sensor_2": (False, None),  # // 7仓NPD电插头下到位
        "c_bc_slot7_lc_retract_sensor_2": (False, None),  # // 7仓NPD水插头上到位
        "c_bc_slot7_lc_extend_sensor_2": (False, None),  # // 7仓NPD水插头下到位
        "c_bc_slot7_check_sensor_1": (False, None),  # // 7仓电池区分NPA
        "c_bc_slot7_check_sensor_2": (False, None),  # // 7仓电池区分NPD
        "c_bc_slot7_reached_sensor": (False, None),  # // 7仓电池落到位
        "c_bc_slot7_smoke_sensor": (False, None),  # // 7仓烟雾报警
        "c_bc_slot7_liq_flow_switch_st": (False, None),  # // 7仓水冷流量开关
        "c_bc_slot8_ec_retract_sensor_1": (False, None),  # // 8仓NPA电插头上到位
        "c_bc_slot8_ec_extend_sensor_1": (False, None),  # // 8仓NPA电插头下到位
        "c_bc_slot8_lc_retract_sensor_1": (False, None),  # // 8仓NPA水插头上到位
        "c_bc_slot8_lc_extend_sensor_1": (False, None),  # // 8仓NPA水插头下到位
        "c_bc_slot8_ec_retract_sensor_2": (False, None),  # // 8仓NPD电插头上到位
        "c_bc_slot8_ec_extend_sensor_2": (False, None),  # // 8仓NPD电插头下到位
        "c_bc_slot8_lc_retract_sensor_2": (False, None),  # // 8仓NPD水插头上到位
        "c_bc_slot8_lc_extend_sensor_2": (False, None),  # // 8仓NPD水插头下到位
        "c_bc_slot8_check_sensor_1": (False, None),  # // 8仓电池区分NPA
        "c_bc_slot8_check_sensor_2": (False, None),  # // 8仓电池区分NPD
        "c_bc_slot8_reached_sensor": (False, None),  # // 8仓电池落到位
        "c_bc_slot8_smoke_sensor": (False, None),  # // 8仓烟雾报警
        "c_bc_slot8_liq_flow_switch_st": (False, None),  # // 8仓水冷流量开关
        "c_bc_slot9_ec_retract_sensor_1": (False, None),  # // 9仓NPA电插头上到位
        "c_bc_slot9_ec_extend_sensor_1": (False, None),  # // 9仓NPA电插头下到位
        "c_bc_slot9_lc_retract_sensor_1": (False, None),  # // 9仓NPA水插头上到位
        "c_bc_slot9_lc_extend_sensor_1": (False, None),  # // 9仓NPA水插头下到位
        "c_bc_slot9_ec_retract_sensor_2": (False, None),  # // 9仓NPD电插头上到位
        "c_bc_slot9_ec_extend_sensor_2": (False, None),  # // 9仓NPD电插头下到位
        "c_bc_slot9_lc_retract_sensor_2": (False, None),  # // 9仓NPD水插头上到位
        "c_bc_slot9_lc_extend_sensor_2": (False, None),  # // 9仓NPD水插头下到位
        "c_bc_slot9_check_sensor_1": (False, None),  # // 9仓电池区分NPA
        "c_bc_slot9_check_sensor_2": (False, None),  # // 9仓电池区分NPD
        "c_bc_slot9_reached_sensor": (False, None),  # // 9仓电池落到位
        "c_bc_slot9_smoke_sensor": (False, None),  # // 9仓烟雾报警
        "c_bc_slot9_liq_flow_switch_st": (False, None),  # // 9仓水冷流量开关
        "c_bc_slot10_ec_retract_sensor_1": (False, None),  # // 10仓NPA电插头上到位
        "c_bc_slot10_ec_extend_sensor_1": (False, None),  # // 10仓NPA电插头下到位
        "c_bc_slot10_lc_retract_sensor_1": (False, None),  # // 10仓NPA水插头上到位
        "c_bc_slot10_lc_extend_sensor_1": (False, None),  # // 10仓NPA水插头下到位
        "c_bc_slot10_ec_retract_sensor_2": (False, None),  # // 10仓NPD电插头上到位
        "c_bc_slot10_ec_extend_sensor_2": (False, None),  # // 10仓NPD电插头下到位
        "c_bc_slot10_lc_retract_sensor_2": (False, None),  # // 10仓NPD水插头上到位
        "c_bc_slot10_lc_extend_sensor_2": (False, None),  # // 10仓NPD水插头下到位
        "c_bc_slot10_check_sensor_1": (False, None),  # // 10仓电池区分NPA
        "c_bc_slot10_check_sensor_2": (False, None),  # // 10仓电池区分NPD
        "c_bc_slot10_reached_sensor": (False, None),  # // 10仓电池落到位
        "c_bc_slot10_smoke_sensor": (False, None),  # // 10仓烟雾报警
        "c_bc_slot10_liq_flow_switch_st": (False, None),  # // 10仓水冷流量开关
        "c_bc_slot6_10_pressure_switch_st": (False, None),  # // 6~10仓水冷压力开关

        # 对接堆垛机
        "c_stacker_low_sensor_1": (False, None),  # // 堆垛机仓位对接1层
        "c_stacker_low_sensor_2": (False, None),  # // 堆垛机仓位对接2层
        "c_stacker_low_sensor_3": (False, None),  # // 堆垛机仓位对接3层
        "c_stacker_low_sensor_4": (False, None),  # // 堆垛机仓位对接4层
        "c_stacker_low_sensor_5": (False, None),  # // 堆垛机仓位对接5层
        "c_stacker_low_sensor_6": (False, None),  # // 堆垛机仓位对接6层
        "c_stacker_low_sensor_0": (False, None),  # // 堆垛机接驳位对接位
        "c_stacker_move_f_sensor": (False, None),  # // 堆垛机行走前仓位
        "c_stacker_move_r_sensor": (False, None),  # // 堆垛机行走后仓位
        "c_stacker_move_RGV_sensor": (False, None),  # // 堆垛机行走RGV对接位
        "c_stacker_left_safe_sensor_1": (False, None),  # // 货叉上层左超程
        "c_stacker_right_safe_sensor_1": (False, None),  # // 货叉上层右超程
        "c_stacker_left_safe_sensor_2": (False, None),  # // 货叉下层左超程
        "c_stacker_right_safe_sensor_2": (False, None),  # // 货叉下层右超程
        "c_fork_retract_sensor_1": (False, None),  # // 货叉主叉臂中点
        "c_fork_retract_sensor_2": (False, None),  # // 货叉辅叉臂中点
        "c_fork_left_extend_sensor_1": (False, None),  # // 货叉叉臂左到位1
        "c_fork_left_extend_sensor_2": (False, None),  # // 货叉叉臂左到位2
        "c_fork_right_extend_sensor_1": (False, None),  # // 货叉叉臂右到位
        "c_fork_bc_exist_sensor_1": (False, None),  # // 货叉有电池1
        "c_fork_bc_exist_sensor_2": (False, None),  # // 货叉有电池2
        "c_vehaicl_l_work_sensor": (False, None),  # // 左车辆举升工作位
        "c_vehaicl_l_maintain_sensor": (False, None),  # // 左车辆举升维护位
        "c_vehaicl_l_safe_sensor": (False, None),  # // 左车辆举升安全
        "c_vehaicl_l_bc_safe_sensor": (False, None),  # // 左车辆举升电池安全
        "c_vehaicl_r_work_sensor": (False, None),  # // 右车辆举升工作位
        "c_vehaicl_r_maintain_sensor": (False, None),  # // 右车辆举升维护位
        "c_vehaicl_r_safe_sensor": (False, None),  # // 右车辆举升安全
        "c_vehaicl_r_bc_safe_sensor": (False, None),  # // 右车辆举升电池安全

        "c_bc_slot11_ec_retract_sensor_1": (False, None),  # // 11仓NPA电插头上到位
        "c_bc_slot11_ec_extend_sensor_1": (False, None),  # // 11仓NPA电插头下到位
        "c_bc_slot11_lc_retract_sensor_1": (False, None),  # // 11仓NPD水插头上到位
        "c_bc_slot11_lc_extend_sensor_1": (False, None),  # // 11仓NPD水插头下到位
        "c_bc_slot11_ec_retract_sensor_2": (False, None),  # // 11仓NPA电插头上到位
        "c_bc_slot11_ec_extend_sensor_2": (False, None),  # // 11仓NPA电插头下到位
        "c_bc_slot11_lc_retract_sensor_2": (False, None),  # // 11仓NPD水插头上到位
        "c_bc_slot11_lc_extend_sensor_2": (False, None),  # // 11仓NPD水插头下到位
        "c_bc_slot11_check_sensor_1": (False, None),  # // 11仓电池区分NPA
        "c_bc_slot11_check_sensor_2": (False, None),  # // 11仓电池区分NPD
        "c_bc_slot11_reached_sensor": (False, None),  # // 11仓电池落到位
        "c_bc_slot11_smoke_sensor": (False, None),  # // 11仓烟雾报警
        "c_bc_slot11_liq_flow_switch_st": (False, None),  # // 11仓水冷流量开关
        "c_bc_slot12_ec_retract_sensor_1": (False, None),  # // 12仓NPA电插头上到位
        "c_bc_slot12_ec_extend_sensor_1": (False, None),  # // 12仓NPA电插头下到位
        "c_bc_slot12_lc_retract_sensor_1": (False, None),  # // 12仓NPA水插头上到位
        "c_bc_slot12_lc_extend_sensor_1": (False, None),  # // 12仓NPA水插头下到位
        "c_bc_slot12_ec_retract_sensor_2": (False, None),  # // 12仓NPD电插头上到位
        "c_bc_slot12_ec_extend_sensor_2": (False, None),  # // 12仓NPD电插头下到位
        "c_bc_slot12_lc_retract_sensor_2": (False, None),  # // 12仓NPD水插头上到位
        "c_bc_slot12_lc_extend_sensor_2": (False, None),  # // 12仓NPD水插头下到位
        "c_bc_slot12_check_sensor_1": (False, None),  # // 12仓电池区分NPA
        "c_bc_slot12_check_sensor_2": (False, None),  # // 12仓电池区分NPD
        "c_bc_slot12_reached_sensor": (False, None),  # // 12仓电池落到位
        "c_bc_slot12_smoke_sensor": (False, None),  # // 12仓烟雾报警
        "c_bc_slot12_liq_flow_switch_st": (False, None),  # // 12仓水冷流量开关
        "c_bc_slot13_ec_retract_sensor_1": (False, None),  # // 13仓NPA电插头上到位
        "c_bc_slot13_ec_extend_sensor_1": (False, None),  # // 13仓NPA电插头下到位
        "c_bc_slot13_lc_retract_sensor_1": (False, None),  # // 13仓NPA水插头上到位
        "c_bc_slot13_lc_extend_sensor_1": (False, None),  # // 13仓NPA水插头下到位
        "c_bc_slot13_ec_retract_sensor_2": (False, None),  # // 13仓NPD电插头上到位
        "c_bc_slot13_ec_extend_sensor_2": (False, None),  # // 13仓NPD电插头下到位
        "c_bc_slot13_lc_retract_sensor_2": (False, None),  # // 13仓NPD水插头上到位
        "c_bc_slot13_lc_extend_sensor_2": (False, None),  # // 13仓NPD水插头下到位
        "c_bc_slot13_check_sensor_1": (False, None),  # // 13仓电池区分NPA
        "c_bc_slot13_check_sensor_2": (False, None),  # // 13仓电池区分NPD
        "c_bc_slot13_reached_sensor": (False, None),  # // 13仓电池落到位
        "c_bc_slot13_smoke_sensor": (False, None),  # // 13仓烟雾报警
        "c_bc_slot13_liq_flow_switch_st": (False, None),  # // 13仓水冷流量开关
        "c_bc_slot14_ec_retract_sensor_1": (False, None),  # // 14仓NPA电插头上到位
        "c_bc_slot14_ec_extend_sensor_1": (False, None),  # // 14仓NPA电插头下到位
        "c_bc_slot14_lc_retract_sensor_1": (False, None),  # // 14仓NPA水插头上到位
        "c_bc_slot14_lc_extend_sensor_1": (False, None),  # // 14仓NPA水插头下到位
        "c_bc_slot14_ec_retract_sensor_2": (False, None),  # // 14仓NPD电插头上到位
        "c_bc_slot14_ec_extend_sensor_2": (False, None),  # // 14仓NPD电插头下到位
        "c_bc_slot14_lc_retract_sensor_2": (False, None),  # // 14仓NPD水插头上到位
        "c_bc_slot14_lc_extend_sensor_2": (False, None),  # // 14仓NPD水插头下到位
        "c_bc_slot14_check_sensor_1": (False, None),  # // 14仓电池区分NPA
        "c_bc_slot14_check_sensor_2": (False, None),  # // 14仓电池区分NPD
        "c_bc_slot14_reached_sensor": (False, None),  # // 14仓电池落到位
        "c_bc_slot14_smoke_sensor": (False, None),  # // 14仓烟雾报警
        "c_bc_slot14_liq_flow_switch_st": (False, None),  # // 14仓水冷流量开关
        "c_bc_slot15_ec_retract_sensor_1": (False, None),  # // 15仓NPA电插头上到位
        "c_bc_slot15_ec_extend_sensor_1": (False, None),  # // 15仓NPA电插头下到位
        "c_bc_slot15_lc_retract_sensor_1": (False, None),  # // 15仓NPA水插头上到位
        "c_bc_slot15_lc_extend_sensor_1": (False, None),  # // 15仓NPA水插头下到位
        "c_bc_slot15_ec_retract_sensor_2": (False, None),  # // 15仓NPD电插头上到位
        "c_bc_slot15_ec_extend_sensor_2": (False, None),  # // 15仓NPD电插头下到位
        "c_bc_slot15_lc_retract_sensor_2": (False, None),  # // 15仓NPD水插头上到位
        "c_bc_slot15_lc_extend_sensor_2": (False, None),  # // 15仓NPD水插头下到位
        "c_bc_slot15_check_sensor_1": (False, None),  # // 15仓电池区分NPA
        "c_bc_slot15_check_sensor_2": (False, None),  # // 15仓电池区分NPD
        "c_bc_slot15_reached_sensor": (False, None),  # // 15仓电池落到位
        "c_bc_slot15_smoke_sensor": (False, None),  # // 15仓烟雾报警
        "c_bc_slot15_liq_flow_switch_st": (False, None),  # // 15仓水冷流量开关
        "c_bc_slot16_ec_retract_sensor_1": (False, None),  # // 16仓NPA电插头上到位 对应的是BMS15
        "c_bc_slot16_ec_extend_sensor_1": (False, None),  # // 16仓NPA电插头下到位
        "c_bc_slot16_lc_retract_sensor_1": (False, None),  # // 16仓NPA水插头上到位
        "c_bc_slot16_lc_extend_sensor_1": (False, None),  # // 16仓NPA水插头下到位
        "c_bc_slot16_ec_retract_sensor_2": (False, None),  # // 16仓NPD电插头上到位
        "c_bc_slot16_ec_extend_sensor_2": (False, None),  # // 16仓NPD电插头下到位
        "c_bc_slot16_lc_retract_sensor_2": (False, None),  # // 16仓NPD水插头上到位
        "c_bc_slot16_lc_extend_sensor_2": (False, None),  # // 16仓NPD水插头下到位
        "c_bc_slot16_check_sensor_1": (False, None),  # // 16仓电池区分NPA
        "c_bc_slot16_check_sensor_2": (False, None),  # // 16仓电池区分NPD
        "c_bc_slot16_reached_sensor": (False, None),  # // 16仓电池落到位
        "c_bc_slot16_smoke_sensor": (False, None),  # // 16仓烟雾报警
        "c_bc_slot16_liq_flow_switch_st": (False, None),  # // 16仓水冷流量开关
        "c_bc_slot17_ec_retract_sensor_1": (False, None),  # // 17仓NPA电插头上到位
        "c_bc_slot17_ec_extend_sensor_1": (False, None),  # // 17仓NPA电插头下到位
        "c_bc_slot17_lc_retract_sensor_1": (False, None),  # // 17仓NPA水插头上到位
        "c_bc_slot17_lc_extend_sensor_1": (False, None),  # // 17仓NPA水插头下到位
        "c_bc_slot17_ec_retract_sensor_2": (False, None),  # // 17仓NPD电插头上到位
        "c_bc_slot17_ec_extend_sensor_2": (False, None),  # // 17仓NPD电插头下到位
        "c_bc_slot17_lc_retract_sensor_2": (False, None),  # // 17仓NPD水插头上到位
        "c_bc_slot17_lc_extend_sensor_2": (False, None),  # // 17仓NPD水插头下到位
        "c_bc_slot17_check_sensor_1": (False, None),  # // 17仓电池区分NPA
        "c_bc_slot17_check_sensor_2": (False, None),  # // 17仓电池区分NPD
        "c_bc_slot17_reached_sensor": (False, None),  # // 17仓电池落到位
        "c_bc_slot17_smoke_sensor": (False, None),  # // 17仓烟雾报警
        "c_bc_slot17_liq_flow_switch_st": (False, None),  # // 17仓水冷流量开关
        "c_bc_slot18_ec_retract_sensor_1": (False, None),  # // 18仓NPA电插头上到位
        "c_bc_slot18_ec_extend_sensor_1": (False, None),  # // 18仓NPA电插头下到位
        "c_bc_slot18_lc_retract_sensor_1": (False, None),  # // 18仓NPA水插头上到位
        "c_bc_slot18_lc_extend_sensor_1": (False, None),  # // 18仓NPA水插头下到位
        "c_bc_slot18_ec_retract_sensor_2": (False, None),  # // 18仓NPD电插头上到位
        "c_bc_slot18_ec_extend_sensor_2": (False, None),  # // 18仓NPD电插头下到位
        "c_bc_slot18_lc_retract_sensor_2": (False, None),  # // 18仓NPD水插头上到位
        "c_bc_slot18_lc_extend_sensor_2": (False, None),  # // 18仓NPD水插头下到位
        "c_bc_slot18_check_sensor_1": (False, None),  # // 18仓电池区分NPA
        "c_bc_slot18_check_sensor_2": (False, None),  # // 18仓电池区分NPD
        "c_bc_slot18_reached_sensor": (False, None),  # // 18仓电池落到位
        "c_bc_slot18_smoke_sensor": (False, None),  # // 18仓烟雾报警
        "c_bc_slot18_liq_flow_switch_st": (False, None),  # // 18仓水冷流量开关
        "c_bc_slot19_ec_retract_sensor_1": (False, None),  # // 19仓NPA电插头上到位
        "c_bc_slot19_ec_extend_sensor_1": (False, None),  # // 19仓NPA电插头下到位
        "c_bc_slot19_lc_retract_sensor_1": (False, None),  # // 19仓NPA水插头上到位
        "c_bc_slot19_lc_extend_sensor_1": (False, None),  # // 19仓NPA水插头下到位
        "c_bc_slot19_ec_retract_sensor_2": (False, None),  # // 19仓NPD电插头上到位
        "c_bc_slot19_ec_extend_sensor_2": (False, None),  # // 19仓NPD电插头下到位
        "c_bc_slot19_lc_retract_sensor_2": (False, None),  # // 19仓NPD水插头上到位
        "c_bc_slot19_lc_extend_sensor_2": (False, None),  # // 19仓NPD水插头下到位
        "c_bc_slot19_check_sensor_1": (False, None),  # // 19仓电池区分NPA
        "c_bc_slot19_check_sensor_2": (False, None),  # // 19仓电池区分NPD
        "c_bc_slot19_reached_sensor": (False, None),  # // 19仓电池落到位
        "c_bc_slot19_smoke_sensor": (False, None),  # // 19仓烟雾报警
        "c_bc_slot19_liq_flow_switch_st": (False, None),  # // 19仓水冷流量开关
        "c_bc_slot20_ec_retract_sensor_1": (False, None),  # // 20仓NPA电插头上到位
        "c_bc_slot20_ec_extend_sensor_1": (False, None),  # // 20仓NPA电插头下到位
        "c_bc_slot20_lc_retract_sensor_1": (False, None),  # // 20仓NPA水插头上到位
        "c_bc_slot20_lc_extend_sensor_1": (False, None),  # // 20仓NPA水插头下到位
        "c_bc_slot20_ec_retract_sensor_2": (False, None),  # // 20仓NPD电插头上到位
        "c_bc_slot20_ec_extend_sensor_2": (False, None),  # // 20仓NPD电插头下到位
        "c_bc_slot20_lc_retract_sensor_2": (False, None),  # // 20仓NPD水插头上到位
        "c_bc_slot20_lc_extend_sensor_2": (False, None),  # // 20仓NPD水插头下到位
        "c_bc_slot20_check_sensor_1": (False, None),  # // 20仓电池区分NPA
        "c_bc_slot20_check_sensor_2": (False, None),  # // 20仓电池区分NPD
        "c_bc_slot20_reached_sensor": (False, None),  # // 20仓电池落到位
        "c_bc_slot20_smoke_sensor": (False, None),  # // 20仓烟雾报警
        "c_bc_slot20_liq_flow_switch_st": (False, None),  # // 20仓水冷流量开关
        "c_bc_slot21_ec_retract_sensor_1": (False, None),  # // 21仓NPA电插头上到位
        "c_bc_slot21_ec_extend_sensor_1": (False, None),  # // 21仓NPA电插头下到位
        "c_bc_slot21_ec_retract_sensor_2": (False, None),  # // 21仓NPD电插头上到位
        "c_bc_slot21_ec_extend_sensor_2": (False, None),  # // 21仓NPD电插头下到位
        "c_bc_slot21_check_sensor_1": (False, None),  # // 21仓电池区分NPA
        "c_bc_slot21_check_sensor_2": (False, None),  # // 21仓电池区分NPD
        "c_bc_slot21_reached_sensor": (False, None),  # // 21仓电池落到位
        "c_bc_slot21_smoke_sensor": (False, None),  # // 21仓烟雾报警
        "c_bc_slot11_15_pressure_switch_st": (False, None),  # // 11~15仓 水冷压力开关
        "c_bc_slot16_20_pressure_switch_st": (False, None),  # // 16~20仓 水冷压力开关
        "c_bc_fire_push_retract_sensor_1": (False, None),  # // 消防接驳前推杆缩回到位
        "c_bc_fire_push_extend_sensor_1": (False, None),  # // 消防接驳前推杆伸出到位
        "c_bc_fire_push_retract_sensor_2": (False, None),  # // 消防接驳后推杆缩回到位
        "c_bc_fire_push_extend_sensor_2": (False, None),  # // 消防接驳后推杆伸出到位
        "c_fire_liq_check": (False, None),  # // 消防液位检测
        "c_fork_X_left_limit_sensor": (False, None),  # // 堆垛机货叉左限位
        "c_fork_X_right_limit_sensor": (False, None),  # // 堆垛机货叉右限位
        "c_fork_X_home_sensor": (False, None),  # // 堆垛机货叉原点
        "c_stacker_move_f_limit_sensor": (False, None),  # // 堆垛机行走前限位
        "c_stacker_move_r_limit_sensor": (False, None),  # // 堆垛机行走后限位
        "c_stacker_move_home_sensor": (False, None),  # // 堆垛机行走原点
        "c_stacker_lift_up_limit_sensor": (False, None),  # // 堆垛机升降上限位
        "c_stacker_lift_down_limit_sensor": (False, None),  # // 堆垛机升降下限位
        "c_stacker_lift_home_sensor": (False, None),  # // 堆垛机升降原点
        "c_pl_move_f_limit_sensor": (False, None),  # // 加解锁平台平移前限位
        "c_pl_move_r_limit_sensor": (False, None),  # // 加解锁平台平移后限位
        "c_pl_move_home_sensor": (False, None),  # // 加解锁平台平移原点
        "c_lr_lift_up_limit_sensor": (False, None),  # // 加解锁平台升降上限位
        "c_lr_lift_down_limit_sensor": (False, None),  # // 加解锁平台升降下限位
        "c_lr_lift_home_sensor": (False, None),  # // 加解锁平台升降原点
        "c_vehical_f_up_limit_sensor": (False, None),  # // 左车辆举升上限位
        "c_vehical_f_down_limit_sensor": (False, None),  # // 左车辆举升下限位
        "c_vehical_f_home_sensor": (False, None),  # // 左车辆举升原点
        "c_vehical_r_up_limit_sensor": (False, None),  # // 右车辆举升上限位
        "c_vehical_r_down_limit_sensor": (False, None),  # // 右车辆举升下限位
        "c_vehical_r_home_sensor": (False, None),  # // 右车辆举升原点
        "c_bc_lift_up_limit_sensor": (False, None),  # // 升降仓上限位
        "c_bc_lift_down_limit_sensor": (False, None),  # // 升降仓下限位
        "c_bc_lift_home_sensor": (False, None),  # // 升降仓原点
        "c_bc_lift_safe_sensor": (False, None),  # // 接驳位举升电池安全
        "c_left_buffer_safe_sensor": (False, None),  # // 左缓存电池安全
        "c_right_buffer_safe_sensor": (False, None),  # // 右缓存电池安全
        "c_bc_slot22_reached_sensor": (False, None),  # // 消防仓电池落到位
        "c_bc_lift_exist_sensor": (False, None),  # // 接驳位上有电池检测
        "c_rgv_bc_reach_sensor_07": (False, None),  # // 电池平整7
        "c_rgv_bc_reach_sensor_08": (False, None),  # // 电池平整8
        "c_liq_lift_zero_sensor": (False, None),  # // 液压举升原点位
        "c_reserved": [(False, None) for _ in range(73)],  # // 预留
    },  # 传感器数据结构定义 500个
    "c_di": {
        "c_emergency_stop_switch_01": (False, None),  # // 急停
        "c_liq_level_warning": (False, None),  # // 液位报警
        "c_I_power_st_1": (False, None),  # // 扩展箱控制供电脱扣报警
        "c_I_power_st_2": (False, None),  # // 扩展箱动力供电脱扣报警
        "c_I_power_st_3": (False, None),  # // 堆垛机货叉伺服供电脱扣报警
        "c_I_power_st_4": (False, None),  # // 堆垛机行走伺服供电脱扣报警
        "c_I_power_st_5": (False, None),  # // 堆垛机升降伺服供电脱扣报警
        "c_I_power_st_6": (False, None),  # // 刹车开关电源后端配电脱扣报警
        "c_I_power_st_7": (False, None),  # // 前轮推杆伺服供电脱扣报警
        "c_I_power_st_8": (False, None),  # // 后轮推杆伺服供电脱扣报警
        "c_I_power_st_9": (False, None),  # // V槽&导向条伺服供电脱扣报警
        "c_I_power_st_10": (False, None),  # // 车身定位销伺服供电脱扣报警
        "c_I_power_st_11": (False, None),  # // 拧紧枪1 伺服供电脱扣报警
        "c_I_power_st_12": (False, None),  # // 拧紧枪2 伺服供电脱扣报警
        "c_I_power_st_13": (False, None),  # // 拧紧枪3&4 伺服供电脱扣报警
        "c_I_power_st_14": (False, None),  # // 拧紧枪5&6 伺服供电脱扣报警
        "c_I_power_st_15": (False, None),  # // 拧紧枪7&8 伺服供电脱扣报警
        "c_I_power_st_16": (False, None),  # // 拧紧枪9 伺服供电脱扣报警
        "c_I_power_st_17": (False, None),  # // 拧紧枪10 伺服供电脱扣报警
        "c_I_power_st_18": (False, None),  # // 拧紧枪11 伺服供电脱扣报警
        "c_I_power_st_19": (False, None),  # // 拧紧枪12 伺服供电脱扣报警
        "c_I_power_st_20": (False, None),  # // 开阖门伺服供电脱扣报警
        "c_I_power_st_21": (False, None),  # // RGV伺服供电脱扣报警
        "c_I_power_st_22": (False, None),  # // 车辆举升伺服供电脱扣报警
        "c_I_power_st_23": (False, None),  # // 接驳位举升伺服供电脱扣报警
        "c_I_power_st_24": (False, None),  # // 变频器供电脱扣报警
        "c_A01_A1_check": (False, None),  # // A01A1检测
        "c_A01_A2_check": (False, None),  # // A01A2检测
        "c_A01_A3_check": (False, None),  # // A01A3检测
        "c_A01_A4_check": (False, None),  # // A01A4检测
        "c_A01_A5_check": (False, None),  # // A01A5检测
        "c_A01_A6_check": (False, None),  # // A01A6检测
        "c_A01_A7_check": (False, None),  # // A01A7检测
        "c_A01_A8_check": (False, None),  # // A01A8检测
        "c_A01_A9_check": (False, None),  # // A01A9检测
        "c_A01_A10_check": (False, None),  # // A01A10检测
        "c_A02_A1_module_status": (False, None),  # // A02A1模块状态
        "c_A02_A2_module_status": (False, None),  # // A02A2模块状态
        "c_A02_A3_module_status": (False, None),  # // A02A3模块状态
        "c_A02_A4_module_status": (False, None),  # // A02A4模块状态
        "c_A02_A5_module_status": (False, None),  # // A02A5模块状态
        "c_A02_A6_module_check": (False, None),  # // A02A6模块状态
        "c_reserved": [(False, None) for _ in range(58)],  # // 预留
    },
    "c_alarm": {
        "c_error_code": [(False, None) for _ in range(2000)],  # 实例化时长度2000
    },
    "c_motion": [{
        "c_id": (i, None),
        "c_interlock_number": (0, None),
        "c_interlock_condition": [(False, None) for _ in range(20)],
        "c_start": (False, None),
        "c_finished": (False, None),
        "c_interlock": (False, None),
        "c_error": (False, None),
        "c_is_running": (False, None),
    } for i in range(280)],
    "c_job_status": {
        "c_bc_job_id": (0, None),
        "c_bc_job_step": (0, None),
        "c_bc_job_finish": (False, None),
        "c_pl_job_id": (0, None),
        "c_pl_job_step": (0, None),
        "c_pl_job_finish": (False, None),
    },
    "c_settings": {
        "c_pl_lf_clamp_pos_work": (0, None),  # // 左前推杆工作位
        "c_pl_lr_clamp_pos_work": (0, None),  # // 左后推杆工作位
        "c_pl_rf_clamp_pos_work": (0, None),  # // 右前推杆工作位
        "c_pl_rr_clamp_pos_work": (0, None),  # // 右后推杆工作位
        "c_pl_v_pos_work": (0, None),  # // V槽工作位
        "c_pl_move_pos_work_NPA": (0, None),  # // 加解锁平台平移工作位_NPA
        "c_pl_move_pos_work_NPD": (0, None),  # // 加解锁平台平移工作位_NPD
        "c_lr_pos_material_fixed": (0, None),  # // 加解锁平台抬升至卡销位
        "c_lr_pos_pin_extend": (0, None),  # // 加解锁平台抬升至销子伸出位
        "c_lr_pos_plug_approach": (0, None),  # // 加解锁平台抬升至接近插头位
        "c_lr_pos_lock": (0, None),  # // 加解锁平台抬升至加解锁位
        "c_lr_lf_vehicle_fixed_pin_pos_work": (0, None),  # // 左前车身定位销伸出位
        "c_lr_rr_vehicle_fixed_pin_pos_work": (0, None),  # // 右后车身定位销伸出位
        "c_lr_lr_vehicle_fixed_pin_pos_work": (0, None),  # // 左后车身定位销伸出位
        "c_pl_f_guide_pos_work": (0, None),  # // 停车平台前导向条伸出位
        "c_pl_r_guide_pos_work": (0, None),  # // 停车平台后导向条伸出位
        "c_door_01_close_pos": (0, None),  # // 左开合门关到位
        "c_door_02_close_pos": (0, None),  # // 右开合门关到位
        "c_pl_lifter_pos_work": (0, None),  # // 升降仓工作位
        "c_stacker_move_f_pos_work": (0, None),  # // 堆垛机平移至前仓
        "c_stacker_move_r_pos_work": (0, None),  # // 堆垛机平移至后仓
        "c_fork_X_pos_work_01": (0, None),  # // 货叉伸出左到位
        "c_fork_X_pos_work_02": (0, None),  # // 货叉伸出右到位
        "c_gun1_Z_pos_work": (0, None),  # // 1号枪头伸出至工作位
        "c_gun2_Z_pos_work": (0, None),  # // 2号枪头伸出至工位位
        "c_gun9_Z_pos_work": (0, None),  # // 9号枪头伸出至工作位
        "c_gun10_Z_pos_work": (0, None),  # // 10号枪头伸出至工作位
        "c_gun9_X_pos_work_02": (0, None),  # // 9号枪头横移至NPD位
        "c_gun10_X_pos_work_02": (0, None),  # // 10号枪头横移至NPD位
        "c_gun11_Z_pos_work": (0, None),  # // 1'号枪头伸出至工作位
        "c_gun21_Z_pos_work": (0, None),  # // 2'号枪头伸出至工位位
        "c_soft_pos_limit": (0, None),  # // 伺服软限位
        "c_fork_X_pos_work_03": (0, None),  # // 货叉接驳位伸出工作位
        "c_stacker_lift_low_pos_C1": (0, None),  # // 堆垛机C1仓低位
        "c_stacker_lift_low_pos_C2": (0, None),  # // 堆垛机C2仓低位
        "c_stacker_lift_low_pos_C3": (0, None),  # // 堆垛机C3仓低位
        "c_stacker_lift_low_pos_C4": (0, None),  # // 堆垛机C4仓低位
        "c_stacker_lift_low_pos_C5": (0, None),  # // 堆垛机C5仓低位
        "c_stacker_lift_low_pos_C6": (0, None),  # // 堆垛机C6仓低位
        "c_stacker_lift_low_pos_C7": (0, None),  # // 堆垛机C7仓低位
        "c_stacker_lift_low_pos_C8": (0, None),  # // 堆垛机C8仓低位
        "c_stacker_lift_low_pos_C9": (0, None),  # // 堆垛机C9仓低位
        "c_stacker_lift_low_pos_C10": (0, None),  # // 堆垛机C10仓低位
        "c_stacker_lift_low_pos_A1": (0, None),  # // 堆垛机A1仓低位
        "c_stacker_lift_low_pos_A2": (0, None),  # // 堆垛机A2仓低位
        "c_stacker_lift_low_pos_A3": (0, None),  # // 堆垛机A3仓低位
        "c_stacker_lift_low_pos_A4": (0, None),  # // 堆垛机A4仓低位
        "c_stacker_lift_low_pos_A5": (0, None),  # // 堆垛机A5仓低位
        "c_stacker_lift_low_pos_A6": (0, None),  # // 堆垛机A6仓低位
        "c_stacker_lift_low_pos_A7": (0, None),  # // 堆垛机A7仓低位
        "c_stacker_lift_low_pos_A8": (0, None),  # // 堆垛机A8仓低位
        "c_stacker_lift_low_pos_A9": (0, None),  # // 堆垛机A9仓低位
        "c_stacker_lift_low_pos_A10": (0, None),  # // 堆垛机A10仓低位
        "c_stacker_lift_low_pos_A11": (0, None),  # // 堆垛机A11仓低位
        "c_stacker_lift_low_pos_A12": (0, None),  # // 消防仓低位
        "c_stacker_move_A12_pos_work": (0, None),  # // 堆垛机平移消防仓位
        "c_fork_X_pos_work_A12": (0, None),  # // 货叉消防仓伸出工作位
        "c_fork_X_pos_work_C6": (0, None),  # // 货叉伸出C6_C10
        "c_fork_X_pos_work_A6": (0, None),  # // 货叉伸出A6_A11
        "c_stacker_move_pos_work_A1": (0, None),  # // 堆垛机平移至A1_A5
        "c_stacker_move_pos_work_A6": (0, None),  # // 堆垛机平移至A6_A11
        "c_gun_1_sign_torque": (0, None),  # // 1枪标定扭矩
        "c_gun_2_sign_torque": (0, None),  # // 2枪标定扭矩
        "c_gun_3_sign_torque": (0, None),  # // 3枪标定扭矩
        "c_gun_4_sign_torque": (0, None),  # // 4枪标定扭矩
        "c_gun_5_sign_torque": (0, None),  # // 5枪标定扭矩
        "c_gun_6_sign_torque": (0, None),  # // 6枪标定扭矩
        "c_gun_7_sign_torque": (0, None),  # // 7枪标定扭矩
        "c_gun_8_sign_torque": (0, None),  # // 8枪标定扭矩
        "c_gun_9_sign_torque": (0, None),  # // 9枪标定扭矩
        "c_gun_10_sign_torque": (0, None),  # // 10枪标定扭矩
        "c_gun_11_sign_torque": (0, None),  # // 1'枪标定扭矩
        "c_gun_12_sign_torque": (0, None),  # // 2'枪标定扭矩
        "c_reserved": [(0, None) for _ in range(5)],  # // 预留
    },
    "c_sys_cmd_st": {
        "c_setting": (False, None),
        "c_stop": (False, None),
        "c_pause": (False, None),
        "c_continue_st": (False, None),
        "c_reset": (False, None),
        "c_change_mode": (False, None),
        "c_initialize": (False, None),
        "c_homing": (False, None),
    },
    "c_plc_version": {
        "c_version": [("", None) for _ in range(11)]
    },
    "c_plc_converter": {
        "c_converter_lift_roller": {  # 升降仓滚筒变频器
            "c_error_code": (0, None),  # 故障码
            "c_power": (0, None),  # 功率
            "c_current": (0, None),  # 电流
            "c_frequency": (0, None),  # 频率
        },
        "c_converter_tranship": {  # 接驳位变频器
            "c_error_code": (0, None),  # 故障码
            "c_power": (0, None),  # 功率
            "c_current": (0, None),  # 电流
            "c_frequency": (0, None),  # 频率
        },
        "c_converter_pl_roller": {  # 停车平台滚筒变频器
            "c_error_code": (0, None),  # 故障码
            "c_power": (0, None),  # 功率
            "c_current": (0, None),  # 电流
            "c_frequency": (0, None),  # 频率
        },
        "c_converter_pl_buffer": {  # 停车平台缓存位变频器
            "c_error_code": (0, None),  # 故障码
            "c_power": (0, None),  # 功率
            "c_current": (0, None),  # 电流
            "c_frequency": (0, None),  # 频率
        },
    },
    "c_plc_cmd_fd": {
        "c_fb_bat_pos": {
            "c_pos": (0, None),  # 选定电池当前仓位号 反馈
        },  # // PLC电池当前仓位号反馈
        "c_fb_photograph": {
            "c_step1": (False, None),  # //车辆定位_01_定位状态
            "c_step2": (False, None),  # //亏电池下表面视觉状态
            "c_step3": (False, None),  # //服务电池上表面视觉状态
            "c_step4": (False, None),  # //车辆定位_02_定位状态
            "c_step5": (False, None),  # //服务电池下表面视觉状态
            "c_step6": (False, None),  # //亏电电池上表面视觉状态
        },  # // PLC视觉拍照步骤反馈
        "c_fb_fire": {
            "c_door_status": (False, None),  # //开合门关闭反馈
            "c_status": (False, None),  # //消防完成标志
            "c_bat_arrived": (False, None),  # //电池是否到达消防仓
            "c_trans_finish": (False, None),  # //消防电池转运完成
            "c_button_status": (False, None),  # // 一键落水机械按键状态
            "c_pl_action_finish": (False, None),  # // 停车平台动作完成（有人值守）
        },  # // PLC消防完成标志位反馈
        "c_fb_home": {
            "c_status": (0, None),  # 零点标定标志位反馈
        },  # // PLC零点标定标志位反馈
        "c_fb_lock_unlock": {
            "c_status": [(False, None) for _ in range(13)],  # //[0]加解锁判断标志位,1：加锁，0：解锁;[1~12]代表1～12轴加解锁
        },  # // PLC一键加/解锁失败反馈
        "c_fb_stacker_pos": {
            "c_pos": (0, None),  # 堆垛机当前仓位号
        },  # // PLC堆垛机当前仓位号反馈
        "c_fb_station": {
            "c_type": (0, None),  # PLC整站类型匹配反馈
        },  # // PLC整站类型反馈
        "c_fb_adapt": {
            "c_result": (0, None),  # PLC轮毂自适应结果反馈
        },  # // PLC轮毂自适应结果反馈
        "c_fb_vehicle": {
            "c_type": (0, None),  # PLC车辆类型结果反馈
        },  # // PLC车辆类型结果反馈
        "c_fb_bat_type": {
            "c_type": [(0, None) for _ in range(21)],  # PLC仓内电池类型结果反馈
        },  # // PLC仓内电池类型反馈
        "c_fb_pl_swap_continue": {
            "c_result": (0, None),  # PLC停车平台可继续动作结果反馈
        },  # // PLC停车平台可继续动作结果反馈
        "c_fb_change_bat": {
            "c_step": (0, None),  # // 倒仓步骤号
            "c_ongoing": (False, None),  # // 是否在倒仓中
            "c_finished": (False, None),  # // 是否倒仓完成
        },  # // PLC倒仓结果反馈
        "c_fb_pin_pressure": {
            "c_lf_value": (0, None),  # // 左前车身定位销压力值
            "c_lr_value": (0, None),  # // 左后车身定位销压力值
            "c_rr_value": (0, None),  # // 右后车身定位销压力值
        },  # // PLC车身定位销压力结果反馈
        "c_fb_lock_direction": {
            "c_direction": (0, None)  # //0-default；1-加锁；2-解锁
        },  # PLC加解锁方向结果反馈
        "c_fb_vehicle_diagnose": {
            "c_allow": (0, None)  # //1-允许车辆自检；其他值-不允许
        },  # PLC允许车辆自检结果反馈
        "c_fb_bc_lift_type": {
            "c_type": (0, None)  # //0-初始值；1-刚性链；2-丝杠
        },  # PLC接驳机结构类型结果反馈
        "c_fb_rolling_door": {
            "c_front_up": (0, None),  # // 前卷帘门上升反馈
            "c_front_stop": (0, None),  # // 前卷帘门停止反馈
            "c_front_down": (0, None),  # // 前卷帘门下降反馈
            "c_back_up": (0, None),  # // 后卷帘门上升反馈
            "c_back_stop": (0, None),  # // 后卷帘门停止反馈
            "c_back_down": (0, None)  # // 后卷帘门下降反馈
        },  # PLC卷帘门执行结果反馈
        "c_fb_swap_rollback": {
            "c_trailer_state": (0, None),  # // 不挂车配置反馈
            "c_swap_rollback": (0, None),  # // 换电失败回退状态
        },  # PLC不挂车及回退状态反馈
        "c_fb_safe_light": {
            "c_state": (0, None),  # // 安全光幕使能状态反馈 0:关闭，1:使能
        },  # PLC安全光幕使能状态反馈
        "c_fb_fire_mode": {
            "c_mode": (0, None),  # // PLC消防模式状态反馈 0:非消防中，1:消防中
        },  # PLC消防模式状态反馈
        "c_fb_station_mode": {
            "c_mode": (0, None),  # // PLC整站模式维护/运营反馈 1:运营模式，2:维护模式
        },  # // PLC整站模式维护/运营反馈
        "c_fb_servo_temp": {
            "c_temp": [(0, None) for _ in range(38)],  # // PLC伺服温度反馈
        },  # // PLC伺服温度反馈
        "c_fb_fire_status": {
            "c_transfer_type": (0, None),  # // 消防转运类型，1:系统自动转运，2:云端远程转运
            "c_drop_type": (0, None),  # // 消防落水类型，1:远程落水，2:机械按键落水
            "c_step": (0, None),  # // 消防转运步骤
            "c_slot": (0, None),  # // 消防仓位号
        },  # // PLC消防状态步骤反馈
        "c_fb_drop_key": {
            "c_result": (0, None)  # // 落水按键改造反馈，0:未改造，1:已改造
        },  # // PLC落水按键改造反馈
        "c_fb_plug_moving_state": {
            "c_npa_liq_state": [(False, None) for _ in range(21)],  # // NPA水插头运动状态反馈，0:未运动，1:运动中
            "c_npa_pwr_state": [(False, None) for _ in range(21)],  # // NPA电插头运动状态反馈，0:未运动，1:运动中
            "c_npd_liq_state": [(False, None) for _ in range(21)],  # // NPD水插头运动状态反馈，0:未运动，1:运动中
            "c_npd_pwr_state": [(False, None) for _ in range(21)],  # // NPD电插头运动状态反馈，0:未运动，1:运动中
        },  # // PLC水电插头运动状态反馈
        "c_fb_swap_cmd": {
            "c_cmd_a": (0, None),  # // 车站并行动作命令A状态反馈，1:成功，2:失败
            "c_cmd_b": (0, None),  # // 车站并行动作命令B状态反馈，1:成功，2:失败
            "c_cmd_c": (0, None)  # // 车站并行动作命令C状态反馈，1:成功，2:失败
        },  # // PLC车站并行动作命令状态反馈
        "c_fb_rgv_position": {
            "c_rgv_position": (0, None)  # // 0:非特殊位置 1:加解锁平台在工作位-10mm及以上 2: 加解锁平台在卡销位+10mm及以下
        },  # // PLC的RGV位置反馈
        "c_reserved": [(0, None) for _ in range(21)],  # // 预留
    },
}


def plc_key_data_init(body):
    """
        对结构体赋值
    :param body:
    :return:
    """
    global status_rep_msg
    data = {}
    body = body.get("plc", {})
    all_info = body.get("status_rep_msg", {})
    alarm_info = body.get("alarm_info", {})
    update_plc_struct_data(status_rep_msg, all_info)

    # debug打印
    # log.warning(f"sensor:{status_rep_msg.get('c_sensor', {}).get('c_bc_slot1_lc_extend_sensor_2')}")

    set_plc_struct_data(status_rep_msg, all_info)
    if alarm_info:
        for i in range(0, 2000):
            k = ALARM_KEY_INDEX.get(i)
            if k in alarm_info:
                v = alarm_info.get(k)
                if (isinstance(v, str) and v.isnumeric()) or v.__class__ == int:
                    temp = True if int(v) != 0 else False
                elif v.__class__ == bool:
                    temp = v
                else:
                    continue
                status_rep_msg["c_alarm"]["c_error_code"][i] = (temp, ALARM_KEY_INDEX.get(i))
                data[ALARM_KEY_INDEX.get(i)] = status_rep_msg["c_alarm"]["c_error_code"][i]
                # if k in ["715485", "715486"]:
                #     log.warning(f"<PLC>:update plc alarm data, key:{k}, value:{temp}")
    return status_rep_msg, data


def update_plc_struct_data(data, body):
    """
        递归，查找key值，并赋值
    :param data:
    :param body:
    :return:
    """
    if isinstance(data, dict) and isinstance(body, dict):
        for k, val in data.items():
            if isinstance(val, dict) and k[2:] in body.keys():
                update_plc_struct_data(val, body[k[2:]])
            elif isinstance(val, list):
                for i in range(len(val)):
                    t = k[2:] + str(i)
                    if t in body.keys():
                        if isinstance(val[i], tuple) and isinstance(body[t], (int, float, str, bool)):
                            tmp = convert_data_type(body[t], val[i])
                            if tmp:
                                val[i] = tmp
                            else:
                                log.warning(f"{k} not get value in post data")
                        elif isinstance(val[i], dict) and isinstance(body[t], dict):
                            update_plc_struct_data(val[i], body[t])
            elif isinstance(val, tuple):
                tmp = convert_data_type(body.get(k[2:], val[0]), val)
                if tmp:
                    data[k] = tmp
                else:
                    log.warning(f"{k} not get value in post data")


def set_plc_struct_data(data, body):
    """
        特定的数据进行初始化赋值
    :param data:
    :param body:
    :return:
    """
    data['c_plc_msg_size']['c_msg_size'] = (13216, None)
    # data["c_mode"]['c_work_mode'] = (2, None)  # {1, 2, 3, 4}

    # data["c_station_type"] = (1, None)  # {1, 3}
    # data['c_current_slot'] = (1, None)  # 当前有效仓位
    # data['c_plc_cmd_fd']['c_fb_fire_mode']['c_mode'] = ()


def convert_data_type(src, dst):
    """
    脚本传输过来的数据和实际的格式不一致，这里需要做转换
    如结构体中的int类型的数据，脚本传输的是字符串
    结构体中的boolean数据，脚本传输的是字符串
    ...

    :param src:
    :param dst:
    :return:
    """
    try:
        if dst[0].__class__ == int:
            return int(src), dst[1]
        elif dst[0].__class__ == bool and src.__class__ in (str, int):
            src = int(src)
            rst = True if src > 0 else False
            return rst, dst[1]
        elif dst[0].__class__ == str and src.__class__ == str:
            return src, dst[1]
    except Exception:
        pass


if __name__ == '__main__':
    pass
    # import ctypes
    # from plc.plc_rep_msg import generate_PLC_STATUS_REP_STRUCT
    #
    # reply_json = plc_key_data_init({})
    # reply_struct = generate_PLC_STATUS_REP_STRUCT(reply_json)
    # print(ctypes.sizeof(reply_struct))  # 12944

    import yaml
    import requests

    with open(r"/Users/wenlong.jin/Desktop/code/py/ps30/test/data/plc.yaml", encoding='utf-8') as file:
        dict_value = yaml.load(file.read(), Loader=yaml.FullLoader)
        # res = plc_key_data_init(dict_value)
        # print(res['c_bc']['c_battery_exist'])
        # print(res["c_mode"]["c_work_mode"])
        # print(res["c_sensor"]["c_roller_door_01_up_limt"])
        # print(res['c_lr']['c_axis'][1]['c_fault'])
        res = requests.post(url="http://10.143.16.44:8888/kylin/plc/allinfo/set",
                            json=dict_value)
        print(res.status_code)
